$VAR1 = {
          'ABI_DUMPER_VERSION' => '0.99.12',
          'ABI_DUMP_VERSION' => '3.2',
          'Arch' => 'x86',
          'Compiler' => 'GNU C++11 5.2.1 20151028 -mtune=generic -march=i686 -g -O2 -std=c++11 -fstack-protector-strong -fvisibility=default -fno-permissive -fPIC -fstack-protector-strong',
          'Headers' => {
                         'AbstractScopeBase.h' => 1,
                         'ActionMetadata.h' => 1,
                         'ActivationListenerBase.h' => 1,
                         'ActivationQueryBase.h' => 1,
                         'ActivationResponse.h' => 1,
                         'Annotation.h' => 1,
                         'Benchmark.h' => 1,
                         'BufferedResultForwarder.h' => 1,
                         'CannedQuery.h' => 1,
                         'CategorisedResult.h' => 1,
                         'Category.h' => 1,
                         'CategoryRenderer.h' => 1,
                         'ChildScope.h' => 1,
                         'ColumnLayout.h' => 1,
                         'CompletionDetails.h' => 1,
                         'DateTimePickerFilter.h' => 1,
                         'Department.h' => 1,
                         'FilterBase.h' => 1,
                         'FilterOption.h' => 1,
                         'FilterState.h' => 1,
                         'InProcessBenchmark.h' => 1,
                         'Link.h' => 1,
                         'ListenerBase.h' => 1,

                                                         '_ZTv0_n12_N5unity6scopes5ReplyD1Ev' => 1,
                                                         '_ZTv0_n12_N5unity6scopes5ScopeD0Ev' => 1,
                                                         '_ZTv0_n12_N5unity6scopes5ScopeD1Ev' => 1,
                                                         '_ZTv0_n12_N5unity6scopes8RegistryD0Ev' => 1,
                                                         '_ZTv0_n12_N5unity6scopes8RegistryD1Ev' => 1,
                                                         '_ZTv0_n12_N5unity6scopes9QueryCtrlD0Ev' => 1,
                                                         '_ZTv0_n12_N5unity6scopes9QueryCtrlD1Ev' => 1,
                                                         '_ZTv0_n16_N5unity6scopes16TimeoutExceptionD0Ev' => 1,
                                                         '_ZTv0_n16_N5unity6scopes16TimeoutExceptionD1Ev' => 1,
                                                         '_ZTv0_n16_N5unity6scopes23ObjectNotExistExceptionD0Ev' => 1,
                                                         '_ZTv0_n16_N5unity6scopes23ObjectNotExistExceptionD1Ev' => 1,
                                                         '_ZTv0_n20_NK5unity6scopes15ConfigException4selfEv' => 1,
                                                         '_ZTv0_n20_NK5unity6scopes16TimeoutException4selfEv' => 1,
                                                         '_ZTv0_n20_NK5unity6scopes17NotFoundException4selfEv' => 1,
                                                         '_ZTv0_n20_NK5unity6scopes19MiddlewareException4selfEv' => 1,
                                                         '_ZTv0_n20_NK5unity6scopes23ObjectNotExistException4selfEv' => 1,
                                                         '_ZTvn4_n12_N5unity6scopes15ConfigExceptionD0Ev' => 1,
                                                         '_ZTvn4_n12_N5unity6scopes15ConfigExceptionD1Ev' => 1,
                                                         '_ZTvn4_n12_N5unity6scopes16TimeoutExceptionD0Ev' => 1,
                                                         '_ZTvn4_n12_N5unity6scopes16TimeoutExceptionD1Ev' => 1,
                                                         '_ZTvn4_n12_N5unity6scopes17NotFoundExceptionD0Ev' => 1,
                                                         '_ZTvn4_n12_N5unity6scopes17NotFoundExceptionD1Ev' => 1,
                                                         '_ZTvn4_n12_N5unity6scopes19MiddlewareExceptionD0Ev' => 1,
                                                         '_ZTvn4_n12_N5unity6scopes19MiddlewareExceptionD1Ev' => 1,
                                                         '_ZTvn4_n12_N5unity6scopes23ObjectNotExistExceptionD0Ev' => 1,
                                                         '_ZTvn4_n12_N5unity6scopes23ObjectNotExistExceptionD1Ev' => 1
                                                       }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '-1' => {
                                    'Name' => '...',
                                    'Type' => 'Intrinsic'
                                  },
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '1000007' => {
                                         'BaseType' => '999357',
                                         'Header' => 'stl_deque.h',
                                         'Line' => '116',
                                         'Name' => 'std::_Deque_iterator<unity::scopes::internal::TaskWrapper, unity::scopes::internal::TaskWrapper&, unity::scopes::internal::TaskWrapper*>::__ptr_to',
                                         'NameSpace' => 'std::_Deque_iterator<unity::scopes::internal::TaskWrapper, unity::scopes::internal::TaskWrapper&, unity::scopes::internal::TaskWrapper*>',
                                         'Private' => 1,
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '1000055' => {
                                         'BaseType' => '1000007',
                                         'Header' => 'stl_deque.h',
                                         'Line' => '123',
                                         'Name' => 'std::_Deque_iterator<unity::scopes::internal::TaskWrapper, unity::scopes::internal::TaskWrapper&, unity::scopes::internal::TaskWrapper*>::_Map_pointer',
                                         'NameSpace' => 'std::_Deque_iterator<unity::scopes::internal::TaskWrapper, unity::scopes::internal::TaskWrapper&, unity::scopes::internal::TaskWrapper*>',
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '1000719' => {
                                         'Copied' => 1,
                                         'Header' => 'stl_deque.h',
                                         'Line' => '458',
                                         'Memb' => {
                                                     '0' => {
                                                              'access' => 'protected',
                                                              'name' => '_M_impl',
                                                              'offset' => '0',
                                                              'type' => '1000732'
                                                            }
                                                   },
                                         'Name' => 'std::_Deque_base<unity::scopes::internal::TaskWrapper, std::allocator<unity::scopes::internal::TaskWrapper> >',
                                         'NameSpace' => 'std',
                                         'Size' => '40',
                                         'TParam' => {
                                                       '0' => {
                                                                'name' => 'unity::scopes::internal::TaskWrapper'
                                                              },
                                                       '1' => {
                                                                'name' => 'std::allocator<unity::scopes::internal::TaskWrapper>'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '1000732' => {
                                         'Base' => {
                                                     '999051' => {
                                                                   'pos' => '0'
                                                                 }
                                                   },
                                         'Copied' => 1,
                                         'Header' => 'stl_deque.h',
                                         'Line' => '548',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => '_M_map',
                                                              'offset' => '0',
                                                              'type' => '1000951'
                                                            },
                                                     '1' => {
                                                              'name' => '_M_map_size',
                                                              'offset' => '4',
                                                              'type' => '7493'
                                                            },
                                                     '2' => {
                                                              'name' => '_M_start',
                                                              'offset' => '8',
                                                              'type' => '1000964'
                                                            },
                                                     '3' => {
                                                              'name' => '_M_finish',
                                                              'offset' => '24',
                                                              'type' => '1000964'
                                                            }
                                                   },
                                         'Name' => 'struct std::_Deque_base<unity::scopes::internal::TaskWrapper, std::allocator<unity::scopes::internal::TaskWrapper> >::_Deque_impl',
                                         'NameSpace' => 'std::_Deque_base<unity::scopes::internal::TaskWrapper, std::allocator<unity::scopes::internal::TaskWrapper> >',
                                         'Protected' => 1,
                                         'Size' => '40',
                                         'Type' => 'Struct'
                                       },
                          '1000951' => {
                                         'BaseType' => '1000055',
                                         'Header' => 'stl_deque.h',
                                         'Line' => '543',
                                         'Name' => 'std::_Deque_base<unity::scopes::internal::TaskWrapper, std::allocator<unity::scopes::internal::TaskWrapper> >::_Map_pointer',
                                         'NameSpace' => 'std::_Deque_base<unity::scopes::internal::TaskWrapper, std::allocator<unity::scopes::internal::TaskWrapper> >',
                                         'Protected' => 1,
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '1000964' => {
                                         'BaseType' => '999984',
                                         'Header' => 'stl_deque.h',
                                         'Line' => '485',
                                         'Name' => 'std::_Deque_base<unity::scopes::internal::TaskWrapper, std::allocator<unity::scopes::internal::TaskWrapper> >::iterator',
                                         'NameSpace' => 'std::_Deque_base<unity::scopes::internal::TaskWrapper, std::allocator<unity::scopes::internal::TaskWrapper> >',
                                         'Size' => '16',
                                         'Type' => 'Typedef'
                                       },
                          '1001807' => {
                                         'Base' => {
                                                     '1000719' => {
                                                                    'access' => 'protected',
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Copied' => 1,
                                         'Header' => 'stl_deque.h',
                                         'Line' => '830',
                                         'Name' => 'std::deque<unity::scopes::internal::TaskWrapper, std::allocator<unity::scopes::internal::TaskWrapper> >',
                                         'NameSpace' => 'std',
                                         'Size' => '40',
                                         'TParam' => {
                                                       '0' => {
                                                                'name' => 'unity::scopes::internal::TaskWrapper'
                                                              },
                                                       '1' => {
                                                                'name' => 'std::allocator<unity::scopes::internal::TaskWrapper>'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '1004879' => {
                                         'Copied' => 1,
                                         'Header' => 'stl_queue.h',
                                         'Line' => '96',
                                         'Memb' => {
                                                     '0' => {
                                                              'access' => 'protected',
                                                              'name' => 'c',
                                                              'offset' => '0',
                                                              'type' => '1001807'
                                                            }
                                                   },
                                         'Name' => 'std::queue<unity::scopes::internal::TaskWrapper, std::deque<unity::scopes::internal::TaskWrapper, std::allocator<unity::scopes::internal::TaskWrapper> > >',
                                         'NameSpace' => 'std',
                                         'Size' => '40',
                                         'TParam' => {
                                                       '0' => {
                                                                'name' => 'unity::scopes::internal::TaskWrapper'
                                                              },
                                                       '1' => {
                                                                'name' => 'std::deque<unity::scopes::internal::TaskWrapper, std::allocator<unity::scopes::internal::TaskWrapper> >'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '1005367' => {
                                         'Copied' => 1,
                                         'Header' => 'unique_ptr.h',
                                         'Line' => '54',
                                         'Name' => 'struct std::default_delete<unity::scopes::internal::RuntimeImpl>',
                                         'NameSpace' => 'std',
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'name' => 'unity::scopes::internal::RuntimeImpl'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '1005449' => {
                                         'Copied' => 1,
                                         'Header' => 'unique_ptr.h',
                                         'Line' => '129',
                                         'Memb' => {
                                                     '0' => {
                                                              'access' => 'private',
                                                              'name' => '_M_t',
                                                              'offset' => '0',
                                                              'type' => '1005486'
                                                            }
                                                   },
                                         'Name' => 'std::unique_ptr<unity::scopes::internal::RuntimeImpl, std::default_delete<unity::scopes::internal::RuntimeImpl> >',
                                         'NameSpace' => 'std',
                                         'Size' => '4',
                                         'TParam' => {
                                                       '0' => {
                                                                'name' => 'unity::scopes::internal::RuntimeImpl'
                                                              },
                                                       '1' => {
                                                                'name' => 'std::default_delete<unity::scopes::internal::RuntimeImpl>'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '1005486' => {
                                         'BaseType' => '1007426',
                                         'Header' => 'unique_ptr.h',
                                         'Line' => '146',
                                         'Name' => 'std::unique_ptr<unity::scopes::internal::RuntimeImpl, std::default_delete<unity::scopes::internal::RuntimeImpl> >::__tuple_type',
                                         'NameSpace' => 'std::unique_ptr<unity::scopes::internal::RuntimeImpl, std::default_delete<unity::scopes::internal::RuntimeImpl> >',
                                         'Private' => 1,
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '1006199' => {
                                         'Base' => {
                                                     '1005367' => {
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Copied' => 1,
                                         'Line' => '55',
                                         'Name' => 'struct std::_Head_base<1u, std::default_delete<unity::scopes::internal::RuntimeImpl>, true>',
                                         'NameSpace' => 'std',
                                         'Size' => '1',
                                         'Source' => 'tuple',
                                         'TParam' => {
                                                       '0' => {
                                                                'name' => '1u'
                                                              },
                                                       '1' => {
                                                                'name' => 'std::default_delete<unity::scopes::internal::RuntimeImpl>'
                                                              },
                                                       '2' => {
                                                                'name' => 'true'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '1006452' => {
                                         'Base' => {
                                                     '1006199' => {
                                                                    'access' => 'private',
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Copied' => 1,
                                         'Line' => '339',
                                         'Name' => 'struct std::_Tuple_impl<1u, std::default_delete<unity::scopes::internal::RuntimeImpl> >',
                                         'NameSpace' => 'std',
                                         'Size' => '1',
                                         'Source' => 'tuple',
                                         'TParam' => {
                                                       '0' => {
                                                                'name' => '1u'
                                                              },
                                                       '1' => {
                                                                'name' => 'std::default_delete<unity::scopes::internal::RuntimeImpl>'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '1006772' => {
                                         'Copied' => 1,
                                         'Line' => '102',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => '_M_head_impl',
                                                              'offset' => '0',
                                                              'type' => '1270046'
                                                            }
                                                   },
                                         'Name' => 'struct std::_Head_base<0u, unity::scopes::internal::RuntimeImpl*, false>',
                                         'NameSpace' => 'std',
                                         'Size' => '4',
                                         'Source' => 'tuple',
                                         'TParam' => {
                                                       '0' => {
                                                                'name' => '0u'
                                                              },
                                                       '1' => {
                                                                'name' => 'unity::scopes::internal::RuntimeImpl*'
                                                              },
                                                       '2' => {
                                                                'name' => 'false'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '1007031' => {
                                         'Base' => {
                                                     '1006452' => {
                                                                    'pos' => '0'
                                                                  },
                                                     '1006772' => {
                                                                    'access' => 'private',
                                                                    'pos' => '1'
                                                                  }
                                                   },
                                         'Copied' => 1,
                                         'Line' => '180',
                                         'Name' => 'struct std::_Tuple_impl<0u, unity::scopes::internal::RuntimeImpl*, std::default_delete<unity::scopes::internal::RuntimeImpl> >',
                                         'NameSpace' => 'std',
                                         'Size' => '4',
                                         'Source' => 'tuple',
                                         'TParam' => {
                                                       '0' => {
                                                                'name' => '0u'
                                                              },
                                                       '1' => {
                                                                'name' => 'unity::scopes::internal::RuntimeImpl*'
                                                              },
                                                       '2' => {
                                                                'name' => 'std::default_delete<unity::scopes::internal::RuntimeImpl>'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '1007426' => {
                                         'Base' => {
                                                     '1007031' => {
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Copied' => 1,
                                         'Line' => '596',
                                         'Name' => 'std::tuple<unity::scopes::internal::RuntimeImpl*, std::default_delete<unity::scopes::internal::RuntimeImpl> >',
                                         'NameSpace' => 'std',
                                         'Size' => '4',
                                         'Source' => 'tuple',
                                         'TParam' => {
                                                       '0' => {
                                                                'name' => 'unity::scopes::internal::RuntimeImpl*'
                                                              },
                                                       '1' => {
                                                                'name' => 'std::default_delete<unity::scopes::internal::RuntimeImpl>'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '1007751' => {
                                         'Base' => {
                                                     '1016923' => {
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Copied' => 1,
                                         'Header' => 'shared_ptr.h',
                                         'Line' => '93',
                                         'Name' => 'std::shared_ptr<unity::scopes::Registry>',
                                         'NameSpace' => 'std',
                                         'Size' => '8',
                                         'TParam' => {
                                                       '0' => {
                                                                'name' => 'unity::scopes::Registry'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '1008008' => {
                                         'Base' => {
                                                     '2253819' => {
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Copied' => 1,
                                         'Header' => 'shared_ptr.h',
                                         'Line' => '93',
                                         'Name' => 'std::shared_ptr<unity::scopes::Object>',
                                         'NameSpace' => 'std',
                                         'Size' => '8',
                                         'TParam' => {
                                                       '0' => {
                                                                'name' => 'unity::scopes::Object'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '1008013' => {
                                         'Base' => {
                                                     '1143507' => {
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Copied' => 1,
                                         'Header' => 'allocator.h',
                                         'Line' => '92',
                                         'Name' => 'std::allocator<std::future<void> >',
                                         'NameSpace' => 'std',
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'name' => 'std::future<void>'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '1008260' => {
                                         'Copied' => 1,
                                         'Header' => 'ptr_traits.h',
                                         'Line' => '150',
                                         'Name' => 'struct std::pointer_traits<std::future<void>*>',
                                         'NameSpace' => 'std',
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'name' => 'std::future<void>*'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '1008319' => {
                                         'BaseType' => '36721',
                                         'Header' => 'ptr_traits.h',
                                         'Line' => '160',
                                         'Name' => 'std::pointer_traits<std::future<void>*>::rebind',
                                         'NameSpace' => 'std::pointer_traits<std::future<void>*>',
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '1008946' => {
                                         'Copied' => 1,
                                         'Header' => 'stl_deque.h',
                                         'Line' => '106',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => '_M_cur',
                                                              'offset' => '0',
                                                              'type' => '1008958'
                                                            },
                                                     '1' => {
                                                              'name' => '_M_first',
                                                              'offset' => '4',
                                                              'type' => '1008958'
                                                            },
                                                     '2' => {
                                                              'name' => '_M_last',
                                                              'offset' => '8',
                                                              'type' => '1008958'
                                                            },
                                                     '3' => {
                                                              'name' => '_M_node',
                                                              'offset' => '12',
                                                              'type' => '1009017'
                                                            }
                                                   },
                                         'Name' => 'struct std::_Deque_iterator<std::future<void>, std::future<void>&, std::future<void>*>',
                                         'NameSpace' => 'std',
                                         'Size' => '16',
                                         'TParam' => {
                                                       '0' => {
                                                                'name' => 'std::future<void>'
                                                              },
                                                       '1' => {
                                                                'name' => 'std::future<void>&'
                                                              },
                                                       '2' => {
                                                                'name' => 'std::future<void>*'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '1008958' => {
                                         'BaseType' => '1008969',
                                         'Header' => 'stl_deque.h',
                                         'Line' => '122',
                                         'Name' => 'std::_Deque_iterator<std::future<void>, std::future<void>&, std::future<void>*>::_Elt_pointer',
                                         'NameSpace' => 'std::_Deque_iterator<std::future<void>, std::future<void>&, std::future<void>*>',
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '1008969' => {
                                         'BaseType' => '1008319',
                                         'Header' => 'stl_deque.h',
                                         'Line' => '116',
                                         'Name' => 'std::_Deque_iterator<std::future<void>, std::future<void>&, std::future<void>*>::__ptr_to',
                                         'NameSpace' => 'std::_Deque_iterator<std::future<void>, std::future<void>&, std::future<void>*>',
                                         'Private' => 1,
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '1009017' => {
                                         'BaseType' => '1008969',
                                         'Header' => 'stl_deque.h',
                                         'Line' => '123',
                                         'Name' => 'std::_Deque_iterator<std::future<void>, std::future<void>&, std::future<void>*>::_Map_pointer',
                                         'NameSpace' => 'std::_Deque_iterator<std::future<void>, std::future<void>&, std::future<void>*>',
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '1009681' => {
                                         'Copied' => 1,
                                         'Header' => 'stl_deque.h',
                                         'Line' => '458',
                                         'Memb' => {
                                                     '0' => {
                                                              'access' => 'protected',
                                                              'name' => '_M_impl',
                                                              'offset' => '0',
                                                              'type' => '1009694'
                                                            }
                                                   },
                                         'Name' => 'std::_Deque_base<std::future<void>, std::allocator<std::future<void> > >',
                                         'NameSpace' => 'std',
                                         'Size' => '40',
                                         'TParam' => {
                                                       '0' => {
                                                                'name' => 'std::future<void>'
                                                              },
                                                       '1' => {
                                                                'name' => 'std::allocator<std::future<void> >'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '1009694' => {
                                         'Base' => {
                                                     '1008013' => {
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Copied' => 1,
                                         'Header' => 'stl_deque.h',
                                         'Line' => '548',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => '_M_map',
                                                              'offset' => '0',
                                                              'type' => '1009913'
                                                            },
                                                     '1' => {
                                                              'name' => '_M_map_size',
                                                              'offset' => '4',
                                                              'type' => '7493'
                                                            },
                                                     '2' => {
                                                              'name' => '_M_start',
                                                              'offset' => '8',
                                                              'type' => '1009926'
                                                            },
                                                     '3' => {
                                                              'name' => '_M_finish',
                                                              'offset' => '24',
                                                              'type' => '1009926'
                                                            }
                                                   },
                                         'Name' => 'struct std::_Deque_base<std::future<void>, std::allocator<std::future<void> > >::_Deque_impl',
                                         'NameSpace' => 'std::_Deque_base<std::future<void>, std::allocator<std::future<void> > >',
                                         'Protected' => 1,
                                         'Size' => '40',
                                         'Type' => 'Struct'
                                       },
                          '1009913' => {
                                         'BaseType' => '1009017',
                                         'Header' => 'stl_deque.h',
                                         'Line' => '543',
                                         'Name' => 'std::_Deque_base<std::future<void>, std::allocator<std::future<void> > >::_Map_pointer',
                                         'NameSpace' => 'std::_Deque_base<std::future<void>, std::allocator<std::future<void> > >',
                                         'Protected' => 1,
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '1009926' => {
                                         'BaseType' => '1008946',
                                         'Header' => 'stl_deque.h',
                                         'Line' => '485',
                                         'Name' => 'std::_Deque_base<std::future<void>, std::allocator<std::future<void> > >::iterator',
                                         'NameSpace' => 'std::_Deque_base<std::future<void>, std::allocator<std::future<void> > >',
                                         'Size' => '16',
                                         'Type' => 'Typedef'
                                       },
                          '1010769' => {
                                         'Base' => {
                                                     '1009681' => {
                                                                    'access' => 'protected',
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Copied' => 1,
                                         'Header' => 'stl_deque.h',
                                         'Line' => '830',
                                         'Name' => 'std::deque<std::future<void>, std::allocator<std::future<void> > >',
                                         'NameSpace' => 'std',
                                         'Size' => '40',
                                         'TParam' => {
                                                       '0' => {
                                                                'name' => 'std::future<void>'
                                                              },
                                                       '1' => {
                                                                'name' => 'std::allocator<std::future<void> >'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '101213' => {
                                        'Header' => 'pthreadtypes.h',
                                        'Line' => '81',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => '__next',
                                                             'offset' => '0',
                                                             'type' => '101238'
                                                           }
                                                  },
                                        'Name' => 'struct __pthread_internal_slist',
                                        'Size' => '4',
                                        'Type' => 'Struct'
                                      },
                          '101238' => {
                                        'BaseType' => '101213',
                                        'Name' => 'struct __pthread_internal_slist*',
                                        'Size' => '4',
                                        'Type' => 'Pointer'
                                      },
                          '101244' => {
                                        'BaseType' => '101213',
                                        'Header' => 'pthreadtypes.h',
                                        'Line' => '84',
                                        'Name' => '__pthread_slist_t',
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '101255' => {
                                        'Header' => 'pthreadtypes.h',
                                        'Line' => '91',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => '__data',
                                                             'offset' => '0',
                                                             'type' => '101268'
                                                           },
                                                    '1' => {
                                                             'name' => '__size',
                                                             'offset' => '0',
                                                             'type' => '101446'
                                                           },
                                                    '2' => {
                                                             'name' => '__align',
                                                             'offset' => '0',
                                                             'type' => '36638'
                                                           }
                                                  },
                                        'Name' => 'union pthread_mutex_t',
                                        'Size' => '24',
                                        'Type' => 'Union'
                                      },
                          '101268' => {
                                        'Header' => 'pthreadtypes.h',
                                        'Line' => '92',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => '__lock',
                                                             'offset' => '0',
                                                             'type' => '36631'
                                                           },
                                                    '1' => {
                                                             'name' => '__count',
                                                             'offset' => '4',
                                                             'type' => '36582'
                                                           },
                                                    '2' => {
                                                             'name' => '__owner',
                                                             'offset' => '8',
                                                             'type' => '36631'
                                                           },
                                                    '3' => {
                                                             'name' => '__kind',
                                                             'offset' => '12',
                                                             'type' => '36631'
                                                           },
                                                    '4' => {
                                                             'name' => '__nusers',
                                                             'offset' => '16',
                                                             'type' => '36582'
                                                           },
                                                    '5' => {
                                                             'name' => 'unnamed0',
                                                             'offset' => '20',
                                                             'type' => '101280'
                                                           }
                                                  },
                                        'Name' => 'struct __pthread_mutex_s',
                                        'Size' => '24',
                                        'Type' => 'Struct'
                                      },
                          '101280' => {
                                        'Header' => 'pthreadtypes.h',
                                        'Line' => '113',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => '__elision_data',
                                                             'offset' => '0',
                                                             'type' => '101288'
                                                           },
                                                    '1' => {
                                                             'name' => '__list',
                                                             'offset' => '0',
                                                             'type' => '101244'
                                                           }
                                                  },
                                        'Name' => '__pthread_mutex_s::anon-union-pthreadtypes.h-113',
                                        'NameSpace' => '__pthread_mutex_s',
                                        'Size' => '4',
                                        'Type' => 'Union'
                                      },
                          '101288' => {
                                        'Header' => 'pthreadtypes.h',
                                        'Line' => '115',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => '__espins',
                                                             'offset' => '0',
                                                             'type' => '36624'
                                                           },
                                                    '1' => {
                                                             'name' => '__elision',
                                                             'offset' => '2',
                                                             'type' => '36624'
                                                           }
                                                  },
                                        'Name' => 'anon-struct-pthreadtypes.h-115',
                                        'Size' => '4',
                                        'Type' => 'Struct'
                                      },
                          '1013841' => {
                                         'Copied' => 1,
                                         'Header' => 'stl_queue.h',
                                         'Line' => '96',
                                         'Memb' => {
                                                     '0' => {
                                                              'access' => 'protected',
                                                              'name' => 'c',
                                                              'offset' => '0',
                                                              'type' => '1010769'
                                                            }
                                                   },
                                         'Name' => 'std::queue<std::future<void>, std::deque<std::future<void>, std::allocator<std::future<void> > > >',
                                         'NameSpace' => 'std',
                                         'Size' => '40',
                                         'TParam' => {
                                                       '0' => {
                                                                'name' => 'std::future<void>'
                                                              },
                                                       '1' => {
                                                                'name' => 'std::deque<std::future<void>, std::allocator<std::future<void> > >'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '1014303' => {
                                         'Base' => {
                                                     '1019964' => {
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Copied' => 1,
                                         'Header' => 'shared_ptr.h',
                                         'Line' => '93',
                                         'Name' => 'std::shared_ptr<unity::scopes::internal::ThreadSafeQueue<std::future<void> > >',
                                         'NameSpace' => 'std',
                                         'Size' => '8',
                                         'TParam' => {
                                                       '0' => {
                                                                'name' => 'unity::scopes::internal::ThreadSafeQueue<std::future<void> >'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '101446' => {
                                        'BaseType' => '36783',
                                        'Name' => 'char[24]',
                                        'Size' => '24',
                                        'Type' => 'Array'
                                      },
                          '1014586' => {
                                         'Copied' => 1,
                                         'Header' => 'unique_ptr.h',
                                         'Line' => '54',
                                         'Name' => 'struct std::default_delete<unity::scopes::internal::MiddlewareFactory>',
                                         'NameSpace' => 'std',
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'name' => 'unity::scopes::internal::MiddlewareFactory'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '101463' => {
                                        'BaseType' => '101255',
                                        'Header' => 'pthreadtypes.h',
                                        'Line' => '128',
                                        'Name' => 'pthread_mutex_t',
                                        'Size' => '24',
                                        'Type' => 'Typedef'
                                      },
                          '1014668' => {
                                         'Base' => {
                                                     '1014586' => {
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Copied' => 1,
                                         'Line' => '55',
                                         'Name' => 'struct std::_Head_base<1u, std::default_delete<unity::scopes::internal::MiddlewareFactory>, true>',
                                         'NameSpace' => 'std',
                                         'Size' => '1',
                                         'Source' => 'tuple',
                                         'TParam' => {
                                                       '0' => {
                                                                'name' => '1u'
                                                              },
                                                       '1' => {
                                                                'name' => 'std::default_delete<unity::scopes::internal::MiddlewareFactory>'
                                                              },
                                                       '2' => {
                                                                'name' => 'true'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '101474' => {
                                        'BaseType' => '101463',
                                        'Header' => 'gthr-default.h',
                                        'Line' => '50',
                                        'Name' => '__gthread_mutex_t',
                                        'Size' => '24',
                                        'Type' => 'Typedef'
                                      },
                          '1014921' => {
                                         'Base' => {
                                                     '1014668' => {
                                                                    'access' => 'private',
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Copied' => 1,
                                         'Line' => '339',
                                         'Name' => 'struct std::_Tuple_impl<1u, std::default_delete<unity::scopes::internal::MiddlewareFactory> >',
                                         'NameSpace' => 'std',
                                         'Size' => '1',
                                         'Source' => 'tuple',
                                         'TParam' => {
                                                       '0' => {
                                                                'name' => '1u'
                                                              },
                                                       '1' => {
                                                                'name' => 'std::default_delete<unity::scopes::internal::MiddlewareFactory>'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '1015241' => {
                                         'Copied' => 1,
                                         'Line' => '102',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => '_M_head_impl',
                                                              'offset' => '0',
                                                              'type' => '1270058'
                                                            }
                                                   },
                                         'Name' => 'struct std::_Head_base<0u, unity::scopes::internal::MiddlewareFactory*, false>',
                                         'NameSpace' => 'std',
                                         'Size' => '4',
                                         'Source' => 'tuple',
                                         'TParam' => {
                                                       '0' => {
                                                                'name' => '0u'
                                                              },
                                                       '1' => {
                                                                'name' => 'unity::scopes::internal::MiddlewareFactory*'
                                                              },
                                                       '2' => {
                                                                'name' => 'false'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '1015500' => {
                                         'Base' => {
                                                     '1014921' => {
                                                                    'pos' => '0'
                                                                  },
                                                     '1015241' => {
                                                                    'access' => 'private',
                                                                    'pos' => '1'
                                                                  }
                                                   },
                                         'Copied' => 1,
                                         'Line' => '180',
                                         'Name' => 'struct std::_Tuple_impl<0u, unity::scopes::internal::MiddlewareFactory*, std::default_delete<unity::scopes::internal::MiddlewareFactory> >',
                                         'NameSpace' => 'std',
                                         'Size' => '4',
                                         'Source' => 'tuple',
                                         'TParam' => {
                                                       '0' => {
                                                                'name' => '0u'
                                                              },
                                                       '1' => {
                                                                'name' => 'unity::scopes::internal::MiddlewareFactory*'
                                                              },
                                                       '2' => {
                                                                'name' => 'std::default_delete<unity::scopes::internal::MiddlewareFactory>'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '1015895' => {
                                         'Base' => {
                                                     '1015500' => {
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Copied' => 1,
                                         'Line' => '596',
                                         'Name' => 'std::tuple<unity::scopes::internal::MiddlewareFactory*, std::default_delete<unity::scopes::internal::MiddlewareFactory> >',
                                         'NameSpace' => 'std',
                                         'Size' => '4',
                                         'Source' => 'tuple',
                                         'TParam' => {
                                                       '0' => {
                                                                'name' => 'unity::scopes::internal::MiddlewareFactory*'
                                                              },
                                                       '1' => {
                                                                'name' => 'std::default_delete<unity::scopes::internal::MiddlewareFactory>'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '1016255' => {
                                         'Copied' => 1,
                                         'Header' => 'shared_ptr_base.h',
                                         'Line' => '867',
                                         'Memb' => {
                                                     '0' => {
                                                              'access' => 'private',
                                                              'name' => '_M_ptr',
                                                              'offset' => '0',
                                                              'type' => '1269689'
                                                            },
                                                     '1' => {
                                                              'access' => 'private',
                                                              'name' => '_M_refcount',
                                                              'offset' => '4',
                                                              'type' => '18021'
                                                            }
                                                   },
                                         'Name' => 'std::__shared_ptr<unity::scopes::internal::MiddlewareBase, 2>',
                                         'NameSpace' => 'std',
                                         'Size' => '8',
                                         'TParam' => {
                                                       '0' => {
                                                                'name' => 'unity::scopes::internal::MiddlewareBase'
                                                              },
                                                       '1' => {
                                                                'name' => '2'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '10166119' => {
                                          'Header' => 'QueryMetadataImpl.h',
                                          'Line' => '34',
                                          'Memb' => {
                                                      '0' => {
                                                               'name' => '_vptr',
                                                               'offset' => '0',
                                                               'type' => '45831'
                                                             },
                                                      '1' => {
                                                               'access' => 'private',
                                                               'name' => 'locale_',
                                                               'offset' => '4',
                                                               'type' => '6675'
                                                             },
                                                      '2' => {
                                                               'access' => 'private',
                                                               'name' => 'form_factor_',
                                                               'offset' => '28',
                                                               'type' => '6675'
                                                             },
                                                      '3' => {
                                                               'access' => 'private',
                                                               'name' => 'hints_',
                                                               'offset' => '52',
                                                               'type' => '105481'
                                                             },
                                                      '4' => {
                                                               'access' => 'private',
                                                               'name' => 'internet_connectivity_',
                                                               'offset' => '76',
                                                               'type' => '10167385'
                                                             }
                                                    },
                                          'Name' => 'unity::scopes::internal::QueryMetadataImpl',
                                          'NameSpace' => 'unity::scopes::internal',
                                          'Size' => '80',
                                          'Type' => 'Class'
                                        },
                          '10166839' => {
                                          'Base' => {
                                                      '10166119' => {
                                                                      'pos' => '0'
                                                                    }
                                                    },
                                          'Header' => 'ActionMetadataImpl.h',
                                          'Line' => '33',
                                          'Memb' => {
                                                      '0' => {
                                                               'access' => 'private',
                                                               'name' => 'scope_data_',
                                                               'offset' => '80',
                                                               'type' => '104143'
                                                             }
                                                    },
                                          'Name' => 'unity::scopes::internal::ActionMetadataImpl',
                                          'NameSpace' => 'unity::scopes::internal',
                                          'Size' => '84',
                                          'Type' => 'Class'
                                        },
                          '10167385' => {
                                          'BaseType' => '36582',
                                          'Header' => 'QueryMetadata.h',
                                          'Line' => '73',
                                          'Memb' => {
                                                      '0' => {
                                                               'name' => 'Unknown',
                                                               'value' => '0'
                                                             },
                                                      '1' => {
                                                               'name' => 'Connected',
                                                               'value' => '1'
                                                             },
                                                      '2' => {
                                                               'name' => 'Disconnected',
                                                               'value' => '2'
                                                             }
                                                    },
                                          'Name' => 'enum unity::scopes::QueryMetadata::ConnectivityStatus',
                                          'NameSpace' => 'unity::scopes::QueryMetadata',
                                          'Size' => '4',
                                          'Type' => 'Enum'
                                        },
                          '10167741' => {
                                          'BaseType' => '10166119',
                                          'Name' => 'unity::scopes::internal::QueryMetadataImpl*',
                                          'Size' => '4',
                                          'Type' => 'Pointer'
                                        },
                          '1016923' => {
                                         'Copied' => 1,
                                         'Header' => 'shared_ptr_base.h',
                                         'Line' => '867',
                                         'Memb' => {
                                                     '0' => {
                                                              'access' => 'private',
                                                              'name' => '_M_ptr',
                                                              'offset' => '0',
                                                              'type' => '1273661'
                                                            },
                                                     '1' => {
                                                              'access' => 'private',
                                                              'name' => '_M_refcount',
                                                              'offset' => '4',
                                                              'type' => '18021'
                                                            }
                                                   },
                                         'Name' => 'std::__shared_ptr<unity::scopes::Registry, 2>',
                                         'NameSpace' => 'std',
                                         'Size' => '8',
                                         'TParam' => {
                                                       '0' => {
                                                                'name' => 'unity::scopes::Registry'
                                                              },
                                                       '1' => {
                                                                'name' => '2'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '1017582' => {
                                         'Copied' => 1,
                                         'Header' => 'unique_ptr.h',
                                         'Line' => '54',
                                         'Name' => 'struct std::default_delete<unity::scopes::internal::Logger>',
                                         'NameSpace' => 'std',
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'name' => 'unity::scopes::internal::Logger'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '1017664' => {
                                         'Base' => {
                                                     '1017582' => {
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Copied' => 1,
                                         'Line' => '55',
                                         'Name' => 'struct std::_Head_base<1u, std::default_delete<unity::scopes::internal::Logger>, true>',
                                         'NameSpace' => 'std',
                                         'Size' => '1',
                                         'Source' => 'tuple',
                                         'TParam' => {
                                                       '0' => {
                                                                'name' => '1u'
                                                              },
                                                       '1' => {
                                                                'name' => 'std::default_delete<unity::scopes::internal::Logger>'
                                                              },
                                                       '2' => {
                                                                'name' => 'true'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '1017917' => {
                                         'Base' => {
                                                     '1017664' => {
                                                                    'access' => 'private',
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Copied' => 1,
                                         'Line' => '339',
                                         'Name' => 'struct std::_Tuple_impl<1u, std::default_delete<unity::scopes::internal::Logger> >',
                                         'NameSpace' => 'std',
                                         'Size' => '1',
                                         'Source' => 'tuple',
                                         'TParam' => {
                                                       '0' => {
                                                                'name' => '1u'
                                                              },
                                                       '1' => {
                                                                'name' => 'std::default_delete<unity::scopes::internal::Logger>'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '10181690' => {
                                          'BaseType' => '10166839',
                                          'Name' => 'unity::scopes::internal::ActionMetadataImpl*',
                                          'Size' => '4',
                                          'Type' => 'Pointer'
                                        },
                          '1018237' => {
                                         'Copied' => 1,
                                         'Line' => '102',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => '_M_head_impl',
                                                              'offset' => '0',
                                                              'type' => '685034'
                                                            }
                                                   },
                                         'Name' => 'struct std::_Head_base<0u, unity::scopes::internal::Logger*, false>',
                                         'NameSpace' => 'std',
                                         'Size' => '4',
                                         'Source' => 'tuple',
                                         'TParam' => {
                                                       '0' => {
                                                                'name' => '0u'
                                                              },
                                                       '1' => {
                                                                'name' => 'unity::scopes::internal::Logger*'
                                                              },
                                                       '2' => {
                                                                'name' => 'false'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '1018496' => {
                                         'Base' => {
                                                     '1017917' => {
                                                                    'pos' => '0'
                                                                  },
                                                     '1018237' => {
                                                                    'access' => 'private',
                                                                    'pos' => '1'
                                                                  }
                                                   },
                                         'Copied' => 1,
                                         'Line' => '180',
                                         'Name' => 'struct std::_Tuple_impl<0u, unity::scopes::internal::Logger*, std::default_delete<unity::scopes::internal::Logger> >',
                                         'NameSpace' => 'std',
                                         'Size' => '4',
                                         'Source' => 'tuple',
                                         'TParam' => {
                                                       '0' => {
                                                                'name' => '0u'
                                                              },
                                                       '1' => {
                                                                'name' => 'unity::scopes::internal::Logger*'
                                                              },
                                                       '2' => {
                                                                'name' => 'std::default_delete<unity::scopes::internal::Logger>'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '1018891' => {
                                         'Base' => {
                                                     '1018496' => {
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Copied' => 1,
                                         'Line' => '596',
                                         'Name' => 'std::tuple<unity::scopes::internal::Logger*, std::default_delete<unity::scopes::internal::Logger> >',
                                         'NameSpace' => 'std',
                                         'Size' => '4',
                                         'Source' => 'tuple',
                                         'TParam' => {
                                                       '0' => {
                                                                'name' => 'unity::scopes::internal::Logger*'
                                                              },
                                                       '1' => {
                                                                'name' => 'std::default_delete<unity::scopes::internal::Logger>'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '1019296' => {
                                         'Copied' => 1,
                                         'Header' => 'shared_ptr_base.h',
                                         'Line' => '867',
                                         'Memb' => {
                                                     '0' => {
                                                              'access' => 'private',
                                                              'name' => '_M_ptr',
                                                              'offset' => '0',
                                                              'type' => '1272438'
                                                            },
                                                     '1' => {
                                                              'access' => 'private',
                                                              'name' => '_M_refcount',
                                                              'offset' => '4',
                                                              'type' => '18021'
                                                            }
                                                   },
                                         'Name' => 'std::__shared_ptr<unity::scopes::internal::ThreadPool, 2>',
                                         'NameSpace' => 'std',
                                         'Size' => '8',
                                         'TParam' => {
                                                       '0' => {
                                                                'name' => 'unity::scopes::internal::ThreadPool'
                                                              },
                                                       '1' => {
                                                                'name' => '2'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '1019964' => {
                                         'Copied' => 1,
                                         'Header' => 'shared_ptr_base.h',
                                         'Line' => '867',
                                         'Memb' => {
                                                     '0' => {
                                                              'access' => 'private',
                                                              'name' => '_M_ptr',
                                                              'offset' => '0',
                                                              'type' => '1273285'
                                                            },
                                                     '1' => {
                                                              'access' => 'private',
                                                              'name' => '_M_refcount',
                                                              'offset' => '4',
                                                              'type' => '18021'
                                                            }
                                                   },
                                         'Name' => 'std::__shared_ptr<unity::scopes::internal::ThreadSafeQueue<std::future<void> >, 2>',
                                         'NameSpace' => 'std',
                                         'Size' => '8',
                                         'TParam' => {
                                                       '0' => {
                                                                'name' => 'unity::scopes::internal::ThreadSafeQueue<std::future<void> >'
                                                              },
                                                       '1' => {
                                                                'name' => '2'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '10230863' => {
                                          'Name' => 'struct std::pair<const std::__cxx11::basic_string<char, std::char_traits<char>, std::allocator<char> >, unity::scopes::Variant>',
                                          'NameSpace' => 'std',
                                          'TParam' => {
                                                        '0' => {
                                                                 'name' => 'const std::__cxx11::basic_string<char, std::char_traits<char>, std::allocator<char> >'
                                                               },
                                                        '1' => {
                                                                 'name' => 'unity::scopes::Variant'
                                                               }
                                                      },
                                          'Type' => 'Struct'
                                        },
                          '10247695' => {
                                          'Base' => {
                                                      '2829640' => {
                                                                     'pos' => '0'
                                                                   }
                                                    },
                                          'Header' => 'ActivationQueryBaseImpl.h',
                                          'Line' => '36',
                                          'Memb' => {
                                                      '0' => {
                                                               'access' => 'private',
                                                               'name' => 'result_',
                                                               'offset' => '36',
                                                               'type' => '43737'
                                                             },
                                                      '1' => {
                                                               'access' => 'private',
                                                               'name' => 'metadata_',
                                                               'offset' => '44',
                                                               'type' => '637074'
                                                             },
                                                      '2' => {
                                                               'access' => 'private',
                                                               'name' => 'widget_id_',
                                                               'offset' => '52',
                                                               'type' => '6686'
                                                             },
                                                      '3' => {
                                                               'access' => 'private',
                                                               'name' => 'action_id_',
                                                               'offset' => '76',
                                                               'type' => '6686'
                                                             },
                                                      '4' => {
                                                               'access' => 'private',
                                                               'name' => 'valid_',
                                                               'offset' => '100',
                                                               'type' => '36673'
                                                             },
                                                      '5' => {
                                                               'access' => 'private',
                                                               'name' => 'mutex_',
                                                               'offset' => '104',
                                                               'type' => '85619'
                                                             }
                                                    },
                                          'Name' => 'unity::scopes::internal::ActivationQueryBaseImpl',
                                          'NameSpace' => 'unity::scopes::internal',
                                          'Size' => '128',
                                          'Type' => 'Class'
                                        },
                          '10251881' => {
                                          'BaseType' => '10247695',
                                          'Name' => 'unity::scopes::internal::ActivationQueryBaseImpl*',
                                          'Size' => '4',
                                          'Type' => 'Pointer'
                                        },
                          '1025684' => {
                                         'Copied' => 1,
                                         'Header' => 'shared_ptr_base.h',
                                         'Line' => '867',
                                         'Memb' => {
                                                     '0' => {
                                                              'access' => 'private',
                                                              'name' => '_M_ptr',
                                                              'offset' => '0',
                                                              'type' => '685510'
                                                            },
                                                     '1' => {
                                                              'access' => 'private',
                                                              'name' => '_M_refcount',
                                                              'offset' => '4',
                                                              'type' => '18021'
                                                            }
                                                   },
                                         'Name' => 'std::__shared_ptr<std::map<std::__cxx11::basic_string<char>, unity::scopes::Variant>, 2>',
                                         'NameSpace' => 'std',
                                         'Size' => '8',
                                         'TParam' => {
                                                       '0' => {
                                                                'name' => 'std::map<std::__cxx11::basic_string<char>, unity::scopes::Variant>'
                                                              },
                                                       '1' => {
                                                                'name' => '2'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '1026384' => {
                                         'Base' => {
                                                     '1025684' => {
                                                                    'pos' => '0'
                                                                  }
                                                   },
                                         'Copied' => 1,
                                         'Header' => 'shared_ptr.h',
                                         'Line' => '93',
                                         'Name' => 'std::shared_ptr<std::map<std::__cxx11::basic_string<char>, unity::scopes::Variant> >',
                                         'NameSpace' => 'std',
                                         'Size' => '8',
                                         'TParam' => {
                                                       '0' => {
                                                                'name' => 'std::map<std::__cxx11::basic_string<char>, unity::scopes::Variant>'
                                                              }
                                                     },
                                         'Type' => 'Class'
                                       },
                          '104143' => {
                                        'Header' => 'Variant.h',
                                        'Line' => '57',
                                        'Memb' => {
                                                    '0' => {
                                                             'access' => 'private',
                                                             'name' => 'p',
                                                             'offset' => '0',
                                                             'type' => '69969'
                                                           }
                                                  },
                                        'Name' => 'unity::scopes::Variant',
                                        'NameSpace' => 'unity::scopes',
                                        'Size' => '4',
                                        'Type' => 'Class'
                                      },
                          '104155' => {
                                        'BaseType' => '36582',
                                        'Header' => 'Variant.h',
                                        'Line' => '63',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'Null',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'Int',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'Bool',
                                                             'value' => '2'
                                                           },
                                                    '3' => {
                                                             'name' => 'String',
                                                             'value' => '3'
                                                           },
                                                    '4' => {
                                                             'name' => 'Double',
                                                             'value' => '4'
                                                           },
                                                    '5' => {
                                                             'name' => 'Dict',
                                                             'value' => '5'
                                                           },
                                                    '6' => {
                                                             'name' => 'Array',
                                                             'value' => '6'
                                                           },
                                                    '7' => {
                                                             'name' => 'Int64',
                                                             'value' => '7'
                                                           }
                                                  },
                                        'Name' => 'enum unity::scopes::Variant::Type',
                                        'NameSpace' => 'unity::scopes::Variant',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '1052708' => {
                                         'Base' => {
                                                     '234229' => {
                                                                   'pos' => '0'
                                                                 }
                                                   },
                                         'Copied' => 1,
                                         'Header' => 'stl_function.h',
                                         'Line' => '382',
                                         'Name' => 'struct std::less<unsigned int>',
                                         'NameSpace' => 'std',
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'name' => 'unsigned int'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '10532960' => {
                                          'Copied' => 1,
                                          'Header' => 'shared_ptr_base.h',
                                          'Line' => '867',
                                          'Memb' => {
                                                      '0' => {
                                                               'access' => 'private',
                                                               'name' => '_M_ptr',
                                                               'offset' => '0',
                                                               'type' => '10561654'
                                                             },
                                                      '1' => {
                                                               'access' => 'private',
                                                               'name' => '_M_refcount',
                                                               'offset' => '4',
                                                               'type' => '18021'
                                                             }
                                                    },
                                          'Name' => 'std::__shared_ptr<unity::scopes::ActivationListenerBase, 2>',
                                          'NameSpace' => 'std',
                                          'Size' => '8',
                                          'TParam' => {
                                                        '0' => {
                                                                 'name' => 'unity::scopes::ActivationListenerBase'
                                                               },
                                                        '1' => {
                                                                 'name' => '2'
                                                               }
                                                      },
                                          'Type' => 'Class'
                                        },
                          '10533578' => {
                                          'Base' => {
                                                      '10532960' => {
                                                                      'pos' => '0'
                                                                    }
                                                    },
                                          'Copied' => 1,
                                          'Header' => 'shared_ptr.h',
                                          'Line' => '93',
                                          'Name' => 'std::shared_ptr<unity::scopes::ActivationListenerBase>',
                                          'NameSpace' => 'std',
                                          'Size' => '8',
                                          'TParam' => {
                                                        '0' => {
                                                                 'name' => 'unity::scopes::ActivationListenerBase'
                                                               }
                                                      },
                                          'Type' => 'Class'
                                        },
                          '10538699' => {
                                          'Base' => {
                                                      '10541401' => {
                                                                      'pos' => '0'
                                                                    }
                                                    },
                                          'Copied' => 1,
                                          'Header' => 'shared_ptr.h',
                                          'Line' => '93',
                                          'Name' => 'std::shared_ptr<unity::scopes::CannedQuery>',
                                          'NameSpace' => 'std',
                                          'Size' => '8',
                                          'TParam' => {
                                                        '0' => {
                                                                 'name' => 'unity::scopes::CannedQuery'
                                                               }
                                                      },
                                          'Type' => 'Class'
                                        },
                          '10541401' => {
                                          'Copied' => 1,
                                          'Header' => 'shared_ptr_base.h',
                                          'Line' => '867',
                                          'Memb' => {
                                                      '0' => {
                                                               'access' => 'private',
                                                               'name' => '_M_ptr',
                                                               'offset' => '0',
                                                               'type' => '109876'
                                                             },
                                                      '1' => {
                                                               'access' => 'private',
                                                               'name' => '_M_refcount',
                                                               'offset' => '4',
                                                               'type' => '18021'
                                                             }
                                                    },
                                          'Name' => 'std::__shared_ptr<unity::scopes::CannedQuery, 2>',
                                          'NameSpace' => 'std',
                                          'Size' => '8',
                                          'TParam' => {
                                                        '0' => {
                                                                 'name' => 'unity::scopes::CannedQuery'
                                                               },
                                                        '1' => {
                                                                 'name' => '2'
                                                               }
                                                      },
                                          'Type' => 'Class'
                                        },
                          '10542069' => {
                                          'Copied' => 1,
                                          'Header' => 'shared_ptr_base.h',
                                          'Line' => '867',
                                          'Memb' => {
                                                      '0' => {
                                                               'access' => 'private',
                                                               'name' => '_M_ptr',
                                                               'offset' => '0',
                                                               'type' => '10562627'
                                                             },
                                                      '1' => {
                                                               'access' => 'private',
                                                               'name' => '_M_refcount',
                                                               'offset' => '4',
                                                               'type' => '18021'
                                                             }
                                                    },
                                          'Name' => 'std::__shared_ptr<unity::scopes::Result, 2>',
                                          'NameSpace' => 'std',
                                          'Size' => '8',
                                          'TParam' => {
                                                        '0' => {
                                                                 'name' => 'unity::scopes::Result'
                                                               },
                                                        '1' => {
                                                                 'name' => '2'
                                                               }
                                                      },
                                          'Type' => 'Class'
                                        },
                          '10542687' => {
                                          'Base' => {
                                                      '10542069' => {
                                                                      'pos' => '0'
                                                                    }
                                                    },
                                          'Copied' => 1,
                                          'Header' => 'shared_ptr.h',
                                          'Line' => '93',
                                          'Name' => 'std::shared_ptr<unity::scopes::Result>',
                                          'NameSpace' => 'std',
                                          'Size' => '8',
                                          'TParam' => {
                                                        '0' => {
                                                                 'name' => 'unity::scopes::Result'
                                                               }
                                                      },
                                          'Type' => 'Class'
                                        },
                          '10542994' => {
                                          'Copied' => 1,
                                          'Header' => 'shared_ptr_base.h',
                                          'Line' => '867',
                                          'Memb' => {
                                                      '0' => {
                                                               'access' => 'private',
                                                               'name' => '_M_ptr',
                                                               'offset' => '0',
                                                               'type' => '691018'
                                                             },
                                                      '1' => {
                                                               'access' => 'private',
                                                               'name' => '_M_refcount',
                                                               'offset' => '4',
                                                               'type' => '18021'
                                                             }
                                                    },
                                          'Name' => 'std::__shared_ptr<std::__cxx11::list<unity::scopes::PreviewWidget>, 2>',
                                          'NameSpace' => 'std',
                                          'Size' => '8',
                                          'TParam' => {
                                                        '0' => {
                                                                 'name' => 'std::__cxx11::list<unity::scopes::PreviewWidget>'
                                                               },
                                                        '1' => {
                                                                 'name' => '2'
                                                               }
                                                      },
                                          'Type' => 'Class'
                                        },
                          '105433' => {
                                        'Line' => '50',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'v',
                                                             'offset' => '0',
                                                             'type' => '28725562'
                                                           }
                                                  },
                                        'Name' => 'struct unity::scopes::internal::VariantImpl',
                                        'NameSpace' => 'unity::scopes::internal',
                                        'Size' => '28',
                                        'Source' => 'Variant.cpp',
                                        'Type' => 'Struct'
                                      },
                          '10543612' => {
                                          'Base' => {
                                                      '10542994' => {
                                                                      'pos' => '0'
                                                                    }
                                                    },
                                          'Copied' => 1,
                                          'Header' => 'shared_ptr.h',
                                          'Line' => '93',
                                          'Name' => 'std::shared_ptr<std::__cxx11::list<unity::scopes::PreviewWidget> >',
                                          'NameSpace' => 'std',
                                          'Size' => '8',
                                          'TParam' => {
                                                        '0' => {
                                                                 'name' => 'std::__cxx11::list<unity::scopes::PreviewWidget>'
                                                               }
                                                      },
                                          'Type' => 'Class'
                                        },
                          '105439' => {
                                        'Copied' => 1,
                                        'Line' => '37',
                                        'Name' => 'struct unity::scopes::internal::NullVariant',
                                        'NameSpace' => 'unity::scopes::internal',
                                        'Size' => '1',
                                        'Source' => 'Variant.cpp',
                                        'Type' => 'Struct'
                                      },
                          '105445' => {
                                        'BaseType' => '105439',
                                        'Name' => 'struct unity::scopes::internal::NullVariant const',
                                        'Type' => 'Const'
                                      },
                          '105455' => {
                                        'Copied' => 1,
                                        'Header' => 'FilterStateImpl.h',
                                        'Line' => '34',
                                        'Memb' => {
                                                    '0' => {
                                                             'access' => 'private',
                                                             'name' => 'state_',
                                                             'offset' => '0',
                                                             'type' => '105481'
                                                           }
                                                  },
                                        'Name' => 'unity::scopes::internal::FilterStateImpl',
                                        'NameSpace' => 'unity::scopes::internal',
                                        'Size' => '24',
                                        'Type' => 'Class'
                                      },
                          '105460' => {
                                        'Copied' => 1,
                                        'Header' => 'CannedQueryImpl.h',
                                        'Line' => '37',
                                        'Memb' => {
                                                    '0' => {
                                                             'access' => 'private',
                                                             'name' => 'scope_id_',
                                                             'offset' => '0',
                                                             'type' => '6675'
                                                           },
                                                    '1' => {
                                                             'access' => 'private',
                                                             'name' => 'query_string_',
                                                             'offset' => '24',
                                                             'type' => '6675'
                                                           },
                                                    '2' => {
                                                             'access' => 'private',
                                                             'name' => 'department_id_',
                                                             'offset' => '48',
                                                             'type' => '6675'
                                                           },
                                                    '3' => {
                                                             'access' => 'private',
                                                             'name' => 'filter_state_',
                                                             'offset' => '72',
                                                             'type' => '105518'
                                                           },
                                                    '4' => {
                                                             'access' => 'private',
                                                             'name' => 'user_data_',
                                                             'offset' => '76',
                                                             'type' => '4937144'
                                                           }
                                                  },
                                        'Name' => 'unity::scopes::internal::CannedQueryImpl',
                                        'NameSpace' => 'unity::scopes::internal',
                                        'Size' => '80',
                                        'Type' => 'Class'
                                      },
                          '105465' => {
                                        'Copied' => 1,
                                        'Header' => 'DepartmentImpl.h',
                                        'Line' => '34',
                                        'Memb' => {
                                                    '0' => {
                                                             'access' => 'private',
                                                             'name' => 'query_',
                                                             'offset' => '0',
                                                             'type' => '105884'
                                                           },
                                                    '1' => {
                                                             'access' => 'private',
                                                             'name' => 'label_',
                                                             'offset' => '4',
                                                             'type' => '6675'
                                                           },
                                                    '2' => {
                                                             'access' => 'private',
                                                             'name' => 'alt_label_',
                                                             'offset' => '28',
                                                             'type' => '6675'
                                                           },
                                                    '3' => {
                                                             'access' => 'private',
                                                             'name' => 'departments_',
                                                             'offset' => '52',
                                                             'type' => '107211'
                                                           },
                                                    '4' => {
                                                             'access' => 'private',
                                                             'name' => 'has_subdepartments_',
                                                             'offset' => '64',
                                                             'type' => '36673'
                                                           }
                                                  },
                                        'Name' => 'unity::scopes::internal::DepartmentImpl',
                                        'NameSpace' => 'unity::scopes::internal',
                                        'Size' => '68',
                                        'Type' => 'Class'
                                      },
                          '105481' => {
                                        'BaseType' => '72271',
                                        'Header' => 'Variant.h',
                                        'Line' => '38',
                                        'Name' => 'unity::scopes::VariantMap',
                                        'NameSpace' => 'unity::scopes',
                                        'Type' => 'Typedef'
                                      },
                          '105492' => {
                                        'BaseType' => '105481',
                                        'Name' => 'unity::scopes::VariantMap const',
                                        'Type' => 'Const'
                                      },
                          '105497' => {
                                        'BaseType' => '72276',
                                        'Header' => 'Variant.h',
                                        'Line' => '43',
                                        'Name' => 'unity::scopes::VariantArray',
                                        'NameSpace' => 'unity::scopes',
                                        'Type' => 'Typedef'
                                      },
                          '105508' => {
                                        'BaseType' => '105497',
                                        'Name' => 'unity::scopes::VariantArray const',
                                        'Type' => 'Const'
                                      },
                          '105513' => {
                                        'BaseType' => '104143',
                                        'Name' => 'unity::scopes::Variant const',
                                        'Size' => '4',
                                        'Type' => 'Const'
                                      },
                          '105518' => {
                                        'Header' => 'FilterState.h',
                                        'Line' => '46',
                                        'Memb' => {
                                                    '0' => {
                                                             'access' => 'private',
                                                             'name' => 'p',
                                                             'offset' => '0',
                                                             'type' => '72389'
                                                           }
                                                  },
                                        'Name' => 'unity::scopes::FilterState',
                                        'NameSpace' => 'unity::scopes',
                                        'Size' => '4',
                                        'Type' => 'Class'
                                      },
                          '10553' => {
                                       'Copied' => 1,
                                       'Header' => 'shared_ptr_base.h',
                                       'Line' => '89',
                                       'Name' => 'std::_Mutex_base<2>',
                                       'NameSpace' => 'std',
                                       'Size' => '1',
                                       'TParam' => {
                                                     '0' => {
                                                              'name' => '2'
                                                            }
                                                   },
                                       'Type' => 'Class'
                                     },
                          '10559446' => {
                                          'Base' => {
                                                      '159884' => {
                                                                    'pos' => '0'
                                                                  }
                                                    },
                                          'Copied' => 1,
                                          'Header' => 'ActivationListenerBase.h',
                                          'Line' => '35',
                                          'Name' => 'unity::scopes::ActivationListenerBase',
                                          'NameSpace' => 'unity::scopes',
                                          'Size' => '4',
                                          'Type' => 'Class',
                                          'VTable' => {
                                                        '0' => '(int (*)(...)) 0',
                                                        '12' => '(int (*)(...)) unity::scopes::ActivationListenerBase::~ActivationListenerBase() [_ZN5unity6scopes22ActivationListenerBaseD0Ev]',
                                                        '16' => '(int (*)(...)) unity::scopes::ActivationListenerBase::finished(unity::scopes::CompletionDetails const&) [_ZN5unity6scopes22ActivationListenerBase8finishedERKNS0_17CompletionDetailsE]',
                                                        '20' => '(int (*)(...)) unity::scopes::ListenerBase::info(unity::scopes::OperationInfo const&) [_ZN5unity6scopes12ListenerBase4infoERKNS0_13OperationInfoE]',
                                                        '24' => '(int (*)(...)) unity::scopes::ActivationListenerBase::finished(unity::scopes::CompletionDetails const&) [_ZN5unity6scopes22ActivationListenerBase8finishedERKNS0_17CompletionDetailsE]',
                                                        '4' => '(int (*)(...)) (& typeinfo for unity::scopes::ActivationListenerBase) [_ZTIN5unity6scopes22ActivationListenerBaseE]',
                                                        '8' => '(int (*)(...)) unity::scopes::ActivationListenerBase::~ActivationListenerBase() [_ZN5unity6scopes22ActivationListenerBaseD1Ev]'
                                                      }
                                        },
                          '10559455' => {
                                          'BaseType' => '10533578',
                                          'Header' => 'ActivationListenerBase.h',
                                          'Line' => '40',
                                          'Name' => 'unity::scopes::ActivationListenerBase::SPtr',
                                          'NameSpace' => 'unity::scopes::ActivationListenerBase',
                                          'Size' => '8',
                                          'Type' => 'Typedef'
                                        },
                          '10559467' => {
                                          'BaseType' => '10559455',
                                          'Name' => 'unity::scopes::ActivationListenerBase::SPtr const',
                                          'Size' => '8',
                                          'Type' => 'Const'
                                        },
                          '10559862' => {
                                          'BaseType' => '10538699',
                                          'Header' => 'CannedQuery.h',
                                          'Line' => '53',
                                          'Name' => 'unity::scopes::CannedQuery::SPtr',
                                          'NameSpace' => 'unity::scopes::CannedQuery',
                                          'Size' => '8',
                                          'Type' => 'Typedef'
                                        },
                          '10561149' => {
                                          'BaseType' => '10542687',
                                          'Header' => 'Result.h',
                                          'Line' => '54',
                                          'Name' => 'unity::scopes::Result::SPtr',
                                          'NameSpace' => 'unity::scopes::Result',
                                          'Size' => '8',
                                          'Type' => 'Typedef'
                                        },
                          '10561574' => {
                                          'BaseType' => '159884',
                                          'Name' => 'unity::scopes::ListenerBase*',
                                          'Size' => '4',
                                          'Type' => 'Pointer'
                                        },
                          '10561654' => {
                                          'BaseType' => '10559446',
                                          'Name' => 'unity::scopes::ActivationListenerBase*',
                                          'Size' => '4',
                                          'Type' => 'Pointer'
                                        },
                          '10562621' => {
                                          'BaseType' => '43737',
                                          'Name' => 'unity::scopes::Result&',
                                          'Size' => '4',
                                          'Type' => 'Ref'
                                        },
                          '10562627' => {
                                          'BaseType' => '43737',
                                          'Name' => 'unity::scopes::Result*',
                                          'Size' => '4',
                                          'Type' => 'Pointer'
                                        },
                          '10563328' => {
                                          'BaseType' => '10559467',
                                          'Name' => 'unity::scopes::ActivationListenerBase::SPtr const&',
                                          'Size' => '4',
                                          'Type' => 'Ref'
                                        },
                          '105879' => {
                                        'BaseType' => '105518',
                                        'Name' => 'unity::scopes::FilterState const',
                                        'Size' => '4',
                                        'Type' => 'Const'
                                      },
                          '105884' => {
                                        'Header' => 'CannedQuery.h',
                                        'Line' => '49',
                                        'Memb' => {
                                                    '0' => {
                                                             'access' => 'private',
                                                             'name' => 'p',
                                                             'offset' => '0',
                                                             'type' => '74799'
                                                           }
                                                  },
                                        'Name' => 'unity::scopes::CannedQuery',
                                        'NameSpace' => 'unity::scopes',
                                        'Size' => '4',
                                        'Type' => 'Class'
                                      },
                          '10623392' => {
                                          'Name' => 'struct std::pair<const std::__cxx11::basic_string<char, std::char_traits<char>, std::allocator<char> >, std::__cxx11::basic_string<char, std::char_traits<char>, std::allocator<char> > >',
                                          'NameSpace' => 'std',
                                          'TParam' => {
                                                        '0' => {
                                                                 'name' => 'const std::__cxx11::basic_string<char, std::char_traits<char>, std::allocator<char> >'
                                                               },
                                                        '1' => {
                                                                 'name' => 'std::__cxx11::basic_string<char, std::char_traits<char>, std::allocator<char> >'
                                                               }
                                                      },
                                          'Type' => 'Struct'
                                        },
                          '10624324' => {
                                          'Name' => 'struct std::_Rb_tree_node<std::pair<const std::__cxx11::basic_string<char, std::char_traits<char>, std::allocator<char> >, std::__cxx11::basic_string<char, std::char_traits<char>, std::allocator<char> > > >',
                                          'NameSpace' => 'std',
                                          'TParam' => {
                                                        '0' => {
                                                                 'name' => 'std::pair<const std::__cxx11::basic_string<char, std::char_traits<char>, std::allocator<char> >, std::__cxx11::basic_string<char, std::char_traits<char>, std::allocator<char> > >'
                                                               }
                                                      },
                                          'Type' => 'Struct'
                                        },
                          '106559' => {
                                        'BaseType' => '105884',
                                        'Name' => 'unity::scopes::CannedQuery const',
                                        'Size' => '4',
                                        'Type' => 'Const'
                                      },
                          '106564' => {
                                        'Header' => 'Department.h',
                                        'Line' => '49',
                                        'Memb' => {
                                                    '0' => {
                                                             'access' => 'private',
                                                             'name' => 'p',
                                                             'offset' => '0',
                                                             'type' => '77216'
                                                           }
                                                  },
                                        'Name' => 'unity::scopes::Department',
                                        'NameSpace' => 'unity::scopes',
                                        'Size' => '4',
                                        'Type' => 'Class'
                                      },
                          '106587' => {
                                        'BaseType' => '79518',
                                        'Header' => 'Department.h',
                                        'Line' => '53',
                                        'Name' => 'unity::scopes::Department::SCPtr',
                                        'NameSpace' => 'unity::scopes::Department',
                                        'Type' => 'Typedef'
                                      },
                          '106599' => {
                                        'BaseType' => '79523',
                                        'Header' => 'Department.h',
                                        'Line' => '53',
                                        'Name' => 'unity::scopes::Department::UPtr',
                                        'NameSpace' => 'unity::scopes::Department',
                                        'Type' => 'Typedef'
                                      },
                          '106903' => {
                                        'BaseType' => '106587',
                                        'Name' => 'unity::scopes::Department::SCPtr const',
                                        'Type' => 'Const'
                                      },
                          '107206' => {
                                        'BaseType' => '106564',
                                        'Name' => 'unity::scopes::Department const',
                                        'Size' => '4',
                                        'Type' => 'Const'
                                      },
                          '107211' => {
                                        'BaseType' => '65929',
                                        'Header' => 'Department.h',
                                        'Line' => '44',
                                        'Name' => 'unity::scopes::DepartmentList',
                                        'NameSpace' => 'unity::scopes',
                                        'Type' => 'Typedef'
                                      },
                          '107222' => {
                                        'BaseType' => '107211',
                                        'Name' => 'unity::scopes::DepartmentList const',
                                        'Type' => 'Const'
                                      },
                          '10763700' => {
                                          'Header' => 'PreviewWidgetImpl.h',
                                          'Line' => '33',
                                          'Memb' => {
                                                      '0' => {
                                                               'access' => 'private',
                                                               'name' => 'id_',
                                                               'offset' => '0',
                                                               'type' => '6675'
                                                             },
                                                      '1' => {
                                                               'access' => 'private',
                                                               'name' => 'type_',
                                                               'offset' => '24',
                                                               'type' => '6675'
                                                             },
                                                      '2' => {
                                                               'access' => 'private',
                                                               'name' => 'attributes_',
                                                               'offset' => '48',
                                                               'type' => '105481'
                                                             },
                                                      '3' => {
                                                               'access' => 'private',
                                                               'name' => 'widgets_',
                                                               'offset' => '72',
                                                               'type' => '635473'
                                                             },
                                                      '4' => {
                                                               'access' => 'private',
                                                               'name' => 'components_',
                                                               'offset' => '84',
                                                               'type' => '2186854'
                                                             }
                                                    },
                                          'Name' => 'unity::scopes::internal::PreviewWidgetImpl',
                                          'NameSpace' => 'unity::scopes::internal',
                                          'Size' => '108',
                                          'Type' => 'Class'
                                        },
                          '10773347' => {
                                          'BaseType' => '10763700',
                                          'Name' => 'unity::scopes::internal::PreviewWidgetImpl*',
                                          'Size' => '4',
                                          'Type' => 'Pointer'
                                        },
                          '10777' => {
                                       'Copied' => 1,
                                       'Header' => 'unique_ptr.h',
                                       'Line' => '54',
                                       'Name' => 'struct std::default_delete<unity::scopes::internal::OperationInfoImpl>',
                                       'NameSpace' => 'std',
                                       'Size' => '1',
                                       'TParam' => {
                                                     '0' => {
                                                              'name' => 'unity::scopes::internal::OperationInfoImpl'
                                                            }
                                                   },
                                       'Type' => 'Struct'
                                     },
                          '107986' => {
                                        'BaseType' => '43742',
                                        'Name' => 'unity::scopes::Category const',
                                        'Type' => 'Const'
                                      },
                          '10846794' => {
                                          'BaseType' => '635468',
                                          'Name' => 'unity::scopes::Result const*',
                                          'Size' => '4',
                                          'Type' => 'Pointer'
                                        },
                          '10848280' => {
                                          'BaseType' => '43737',
                                          'Name' => 'unity::scopes::Result&&',
                                          'Size' => '4',
                                          'Type' => 'RvalueRef'
                                        },
                          '10856367' => {
                                          'BaseType' => '637175',
                                          'Name' => 'unity::scopes::PreviewWidget&&',
                                          'Size' => '4',
                                          'Type' => 'RvalueRef'
                                        },
                          '10856475' => {
                                          'BaseType' => '10856367',
                                          'Name' => 'unity::scopes::PreviewWidget&&const',
                                          'Size' => '4',
                                          'Type' => 'Const'
                                        },
                          '10859' => {
                                       'Copied' => 1,
                                       'Header' => 'unique_ptr.h',
                                       'Line' => '129',
                                       'Memb' => {
                                                   '0' => {
                                                            'access' => 'private',
                                                            'name' => '_M_t',
                                                            'offset' => '0',
                                                            'type' => '10896'
                                                          }
                                                 },
                                       'Name' => 'std::unique_ptr<unity::scopes::internal::OperationInfoImpl, std::default_delete<unity::scopes::internal::OperationInfoImpl> >',
                                       'NameSpace' => 'std',
                                       'Size' => '4',
                                       'TParam' => {
                                                     '0' => {
                                                              'name' => 'unity::scopes::internal::OperationInfoImpl'
                                                            },
                                                     '1' => {
                                                              'name' => 'std::default_delete<unity::scopes::internal::OperationInfoImpl>'
                                                            }
                                                   },
                                       'Type' => 'Class'
                                     },
                          '10866999' => {
                                          'BaseType' => '109888',
                                          'Name' => 'unity::scopes::CannedQuery&&const',
                                          'Size' => '4',
                                          'Type' => 'Const'
                                        },
                          '10867530' => {
                                          'BaseType' => '10848280',
                                          'Name' => 'unity::scopes::Result&&const',
                                          'Size' => '4',
                                          'Type' => 'Const'
                                        },
                          '10896' => {
                                       'BaseType' => '12836',
                                       'Header' => 'unique_ptr.h',
                                       'Line' => '146',
                                       'Name' => 'std::unique_ptr<unity::scopes::internal::OperationInfoImpl, std::default_delete<unity::scopes::internal::OperationInfoImpl> >::__tuple_type',
                                       'NameSpace' => 'std::unique_ptr<unity::scopes::internal::OperationInfoImpl, std::default_delete<unity::scopes::internal::OperationInfoImpl> >',
                                       'Private' => 1,
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '109009' => {
                                        'Copied' => 1,
                                        'Header' => 'CategoryRenderer.h',
                                        'Line' => '83',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => '_vptr',
                                                             'offset' => '0',
                                                             'type' => '45831'
                                                           },
                                                    '1' => {
                                                             'access' => 'private',
                                                             'name' => 'p',
                                                             'offset' => '4',
                                                             'type' => '26463904'
                                                           }
                                                  },
                                        'Name' => 'unity::scopes::CategoryRenderer',
                                        'NameSpace' => 'unity::scopes',
                                        'Size' => '8',
                                        'Type' => 'Class',
                                        'VTable' => {
                                                      '0' => '(int (*)(...)) 0',
                                                      '12' => '(int (*)(...)) unity::scopes::CategoryRenderer::~CategoryRenderer() [_ZN5unity6scopes16CategoryRendererD0Ev]',
                                                      '4' => '(int (*)(...)) (& typeinfo for unity::scopes::CategoryRenderer) [_ZTIN5unity6scopes16CategoryRendererE]',
                                                      '8' => '(int (*)(...)) unity::scopes::CategoryRenderer::~CategoryRenderer() [_ZN5unity6scopes16CategoryRendererD1Ev]'
                                                    }
                                      },
                          '109014' => {
                                        'BaseType' => '109009',
                                        'Name' => 'unity::scopes::CategoryRenderer const',
                                        'Type' => 'Const'
                                      },
                          '109030' => {
                                        'Copied' => 1,
                                        'Header' => 'Annotation.h',
                                        'Line' => '51',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => '_vptr',
                                                             'offset' => '0',
                                                             'type' => '45831'
                                                           },
                                                    '1' => {
                                                             'access' => 'private',
                                                             'name' => 'p',
                                                             'offset' => '4',
                                                             'type' => '26193886'
                                                           }
                                                  },
                                        'Name' => 'unity::scopes::experimental::Annotation',
                                        'NameSpace' => 'unity::scopes::experimental',
                                        'Size' => '8',
                                        'Type' => 'Class',
                                        'VTable' => {
                                                      '0' => '(int (*)(...)) 0',
                                                      '12' => '(int (*)(...)) unity::scopes::experimental::Annotation::~Annotation() [_ZN5unity6scopes12experimental10AnnotationD0Ev]',
                                                      '4' => '(int (*)(...)) (& typeinfo for unity::scopes::experimental::Annotation) [_ZTIN5unity6scopes12experimental10AnnotationE]',
                                                      '8' => '(int (*)(...)) unity::scopes::experimental::Annotation::~Annotation() [_ZN5unity6scopes12experimental10AnnotationD1Ev]'
                                                    }
                                      },
                          '109035' => {
                                        'BaseType' => '109030',
                                        'Name' => 'unity::scopes::experimental::Annotation const',
                                        'Type' => 'Const'
                                      },
                          '109041' => {
                                        'BaseType' => '65934',
                                        'Header' => 'FilterBase.h',
                                        'Line' => '106',
                                        'Name' => 'unity::scopes::Filters',
                                        'NameSpace' => 'unity::scopes',
                                        'Type' => 'Typedef'
                                      },
                          '109052' => {
                                        'BaseType' => '109041',
                                        'Name' => 'unity::scopes::Filters const',
                                        'Type' => 'Const'
                                      },
                          '109057' => {
                                        'Copied' => 1,
                                        'Header' => 'Object.h',
                                        'Line' => '34',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => '_vptr',
                                                             'offset' => '0',
                                                             'type' => '45831'
                                                           }
                                                  },
                                        'Name' => 'unity::scopes::Object',
                                        'NameSpace' => 'unity::scopes',
                                        'Size' => '4',
                                        'Type' => 'Class',
                                        'VTable' => {
                                                      '0' => '(int (*)(...)) 0',
                                                      '12' => '0u',
                                                      '16' => '(int (*)(...)) __cxa_pure_virtual',
                                                      '20' => '(int (*)(...)) __cxa_pure_virtual',
                                                      '24' => '(int (*)(...)) __cxa_pure_virtual',
                                                      '28' => '(int (*)(...)) __cxa_pure_virtual',
                                                      '32' => '(int (*)(...)) __cxa_pure_virtual',
                                                      '4' => '(int (*)(...)) (& typeinfo for unity::scopes::Object) [_ZTIN5unity6scopes6ObjectE]',
                                                      '8' => '0u'
                                                    }
                                      },
                          '109105' => {
                                        'BaseType' => '105433',
                                        'Name' => 'struct unity::scopes::internal::VariantImpl*',
                                        'Size' => '4',
                                        'Type' => 'Pointer'
                                      },
                          '10929048' => {
                                          'Copied' => 1,
                                          'Header' => 'stl_list.h',
                                          'Line' => '298',
                                          'Memb' => {
                                                      '0' => {
                                                               'access' => 'protected',
                                                               'name' => '_M_impl',
                                                               'offset' => '0',
                                                               'type' => '10929061'
                                                             }
                                                    },
                                          'Name' => 'std::__cxx11::_List_base<std::shared_ptr<unity::scopes::Link const>, std::allocator<std::shared_ptr<unity::scopes::Link const> > >',
                                          'NameSpace' => 'std::__cxx11',
                                          'Size' => '12',
                                          'TParam' => {
                                                        '0' => {
                                                                 'name' => 'std::shared_ptr<unity::scopes::Link const>'
                                                               },
                                                        '1' => {
                                                                 'name' => 'std::allocator<std::shared_ptr<unity::scopes::Link const> >'
                                                               }
                                                      },
                                          'Type' => 'Class'
                                        },
                          '10929061' => {
                                          'Base' => {
                                                      '10952782' => {
                                                                      'pos' => '0'
                                                                    }
                                                    },
                                          'Copied' => 1,
                                          'Header' => 'stl_list.h',
                                          'Line' => '332',
                                          'Memb' => {
                                                      '0' => {
                                                               'name' => '_M_node',
                                                               'offset' => '0',
                                                               'type' => '214044'
                                                             }
                                                    },
                                          'Name' => 'struct std::__cxx11::_List_base<std::shared_ptr<unity::scopes::Link const>, std::allocator<std::shared_ptr<unity::scopes::Link const> > >::_List_impl',
                                          'NameSpace' => 'std::__cxx11::_List_base<std::shared_ptr<unity::scopes::Link const>, std::allocator<std::shared_ptr<unity::scopes::Link const> > >',
                                          'Protected' => 1,
                                          'Size' => '12',
                                          'Type' => 'Struct'
                                        },
                          '10929883' => {
                                          'Base' => {
                                                      '10929048' => {
                                                                      'access' => 'protected',
                                                                      'pos' => '0'
                                                                    }
                                                    },
                                          'Copied' => 1,
                                          'Header' => 'stl_list.h',
                                          'Line' => '507',
                                          'Name' => 'std::__cxx11::list<std::shared_ptr<unity::scopes::Link const> >',
                                          'NameSpace' => 'std::__cxx11',
                                          'Size' => '12',
                                          'TParam' => {
                                                        '0' => {
                                                                 'name' => 'std::shared_ptr<unity::scopes::Link const>'
                                                               }
                                                      },
                                          'Type' => 'Class'
                                        },
                          '109326' => {
                                        'BaseType' => '104143',
                                        'Name' => 'unity::scopes::Variant*',
                                        'Size' => '4',
                                        'Type' => 'Pointer'
                                      },
                          '109332' => {
                                        'BaseType' => '105492',
                                        'Name' => 'unity::scopes::VariantMap const&',
                                        'Size' => '4',
                                        'Type' => 'Ref'
                                      },
                          '109338' => {
                                        'BaseType' => '105508',
                                        'Name' => 'unity::scopes::VariantArray const&',
                                        'Size' => '4',
                                        'Type' => 'Ref'
                                      },
                          '109344' => {
                                        'BaseType' => '105513',
                                        'Name' => 'unity::scopes::Variant const&',
                                        'Size' => '4',
                                        'Type' => 'Ref'
                                      },
                          '109350' => {
                                        'BaseType' => '104143',
                                        'Name' => 'unity::scopes::Variant&&',
                                        'Size' => '4',
                                        'Type' => 'RvalueRef'
                                      },
                          '109356' => {
                                        'BaseType' => '104143',
                                        'Name' => 'unity::scopes::Variant&',
                                        'Size' => '4',
                                        'Type' => 'Ref'
                                      },
                          '109362' => {
                                        'BaseType' => '105513',
                                        'Name' => 'unity::scopes::Variant const*',
                                        'Size' => '4',
                                        'Type' => 'Pointer'
                                      },
                          '109368' => {
                                        'BaseType' => '105445',
                                        'Name' => 'struct unity::scopes::internal::NullVariant const&',
                                        'Size' => '4',
                                        'Type' => 'Ref'
                                      },
                          '109392' => {
                                        'BaseType' => '105455',
                                        'Name' => 'unity::scopes::internal::FilterStateImpl*',
                                        'Size' => '4',
                                        'Type' => 'Pointer'
                                      },
                          '10949279' => {
                                          'Copied' => 1,
                                          'Header' => 'unique_ptr.h',
                                          'Line' => '54',
                                          'Name' => 'struct std::default_delete<unity::scopes::internal::LinkImpl>',
                                          'NameSpace' => 'std',
                                          'Size' => '1',
                                          'TParam' => {
                                                        '0' => {
                                                                 'name' => 'unity::scopes::internal::LinkImpl'
                                                               }
                                                      },
                                          'Type' => 'Struct'
                                        },
                          '10949361' => {
                                          'Copied' => 1,
                                          'Header' => 'unique_ptr.h',
                                          'Line' => '129',
                                          'Memb' => {
                                                      '0' => {
                                                               'access' => 'private',
                                                               'name' => '_M_t',
                                                               'offset' => '0',
                                                               'type' => '10949398'
                                                             }
                                                    },
                                          'Name' => 'std::unique_ptr<unity::scopes::internal::LinkImpl, std::default_delete<unity::scopes::internal::LinkImpl> >',
                                          'NameSpace' => 'std',
                                          'Size' => '4',
                                          'TParam' => {
                                                        '0' => {
                                                                 'name' => 'unity::scopes::internal::LinkImpl'
                                                               },
                                                        '1' => {
                                                                 'name' => 'std::default_delete<unity::scopes::internal::LinkImpl>'
                                                               }
                                                      },
                                          'Type' => 'Class'
                                        },
                          '10949398' => {
                                          'BaseType' => '10951338',
                                          'Header' => 'unique_ptr.h',
                                          'Line' => '146',
                                          'Name' => 'std::unique_ptr<unity::scopes::internal::LinkImpl, std::default_delete<unity::scopes::internal::LinkImpl> >::__tuple_type',
                                          'NameSpace' => 'std::unique_ptr<unity::scopes::internal::LinkImpl, std::default_delete<unity::scopes::internal::LinkImpl> >',
                                          'Private' => 1,
                                          'Size' => '4',
                                          'Type' => 'Typedef'
                                        },
                          '10950111' => {
                                          'Base' => {
                                                      '10949279' => {
                                                                      'pos' => '0'
                                                                    }
                                                    },
                                          'Copied' => 1,
                                          'Line' => '55',
                                          'Name' => 'struct std::_Head_base<1u, std::default_delete<unity::scopes::internal::LinkImpl>, true>',
                                          'NameSpace' => 'std',
                                          'Size' => '1',
                                          'Source' => 'tuple',
                                          'TParam' => {
                                                        '0' => {
                                                                 'name' => '1u'
                                                               },
                                                        '1' => {
                                                                 'name' => 'std::default_delete<unity::scopes::internal::LinkImpl>'
                                                               },
                                                        '2' => {
                                                                 'name' => 'true'
                                                               }
                                                      },
                                          'Type' => 'Struct'
                                        },
                          '10950364' => {
                                          'Base' => {
                                                      '10950111' => {
                                                                      'access' => 'private',
                                                                      'pos' => '0'
                                                                    }
                                                    },
                                          'Copied' => 1,
                                          'Line' => '339',
                                          'Name' => 'struct std::_Tuple_impl<1u, std::default_delete<unity::scopes::internal::LinkImpl> >',
                                          'NameSpace' => 'std',
                                          'Size' => '1',
                                          'Source' => 'tuple',
                                          'TParam' => {
                                                        '0' => {
                                                                 'name' => '1u'
                                                               },
                                                        '1' => {
                                                                 'name' => 'std::default_delete<unity::scopes::internal::LinkImpl>'
                                                               }
                                                      },
                                          'Type' => 'Struct'
                                        },
                          '10950684' => {
                                          'Copied' => 1,
                                          'Line' => '102',
                                          'Memb' => {
                                                      '0' => {
                                                               'name' => '_M_head_impl',
                                                               'offset' => '0',
                                                               'type' => '10986088'
                                                             }
                                                    },
                                          'Name' => 'struct std::_Head_base<0u, unity::scopes::internal::LinkImpl*, false>',
                                          'NameSpace' => 'std',
                                          'Size' => '4',
                                          'Source' => 'tuple',
                                          'TParam' => {
                                                        '0' => {
                                                                 'name' => '0u'
                                                               },
                                                        '1' => {
                                                                 'name' => 'unity::scopes::internal::LinkImpl*'
                                                               },
                                                        '2' => {
                                                                 'name' => 'false'
                                                               }
                                                      },
                                          'Type' => 'Struct'
                                        },
                          '10950943' => {
                                          'Base' => {
                                                      '10950364' => {
                                                                      'pos' => '0'
                                                                    },
                                                      '10950684' => {
                                                                      'access' => 'private',
                                                                      'pos' => '1'
                                                                    }
                                                    },
                                          'Copied' => 1,
                                          'Line' => '180',
                                          'Name' => 'struct std::_Tuple_impl<0u, unity::scopes::internal::LinkImpl*, std::default_delete<unity::scopes::internal::LinkImpl> >',
                                          'NameSpace' => 'std',
                                          'Size' => '4',
                                          'Source' => 'tuple',
                                          'TParam' => {
                                                        '0' => {
                                                                 'name' => '0u'
                                                               },
                                                        '1' => {
                                                                 'name' => 'unity::scopes::internal::LinkImpl*'
                                                               },
                                                        '2' => {
                                                                 'name' => 'std::default_delete<unity::scopes::internal::LinkImpl>'
                                                               }
                                                      },
                                          'Type' => 'Struct'
                                        },
                          '10951338' => {
                                          'Base' => {
                                                      '10950943' => {
                                                                      'pos' => '0'
                                                                    }
                                                    },
                                          'Copied' => 1,
                                          'Line' => '596',
                                          'Name' => 'std::tuple<unity::scopes::internal::LinkImpl*, std::default_delete<unity::scopes::internal::LinkImpl> >',
                                          'NameSpace' => 'std',
                                          'Size' => '4',
                                          'Source' => 'tuple',
                                          'TParam' => {
                                                        '0' => {
                                                                 'name' => 'unity::scopes::internal::LinkImpl*'
                                                               },
                                                        '1' => {
                                                                 'name' => 'std::default_delete<unity::scopes::internal::LinkImpl>'
                                                               }
                                                      },
                                          'Type' => 'Class'
                                        },
                          '10951989' => {
                                          'Base' => {
                                                      '10964911' => {
                                                                      'pos' => '0'
                                                                    }
                                                    },
                                          'Copied' => 1,
                                          'Header' => 'shared_ptr.h',
                                          'Line' => '93',
                                          'Name' => 'std::shared_ptr<unity::scopes::Link const>',
                                          'NameSpace' => 'std',
                                          'Size' => '8',
                                          'TParam' => {
                                                        '0' => {
                                                                 'name' => 'unity::scopes::Link const'
                                                               }
                                                      },
                                          'Type' => 'Class'
                                        },
                          '10952581' => {
                                          'Base' => {
                                                      '10972645' => {
                                                                      'pos' => '0'
                                                                    }
                                                    },
                                          'Copied' => 1,
                                          'Header' => 'allocator.h',
                                          'Line' => '92',
                                          'Name' => 'std::allocator<std::shared_ptr<unity::scopes::Link const> >',
                                          'NameSpace' => 'std',
                                          'Size' => '1',
                                          'TParam' => {
                                                        '0' => {
                                                                 'name' => 'std::shared_ptr<unity::scopes::Link const>'
                                                               }
                                                      },
                                          'Type' => 'Class'
                                        },
                          '10952782' => {
                                          'Base' => {
                                                      '10972983' => {
                                                                      'pos' => '0'
                                                                    }
                                                    },
                                          'Copied' => 1,
                                          'Header' => 'allocator.h',
                                          'Line' => '92',
                                          'Name' => 'std::allocator<std::_List_node<std::shared_ptr<unity::scopes::Link const> > >',
                                          'NameSpace' => 'std',
                                          'Size' => '1',
                                          'TParam' => {
                                                        '0' => {
                                                                 'name' => 'std::_List_node<std::shared_ptr<unity::scopes::Link const> >'
                                                               }
                                                      },
                                          'Type' => 'Class'
                                        },
                          '10952886' => {
                                          'Base' => {
                                                      '208717' => {
                                                                    'pos' => '0'
                                                                  }
                                                    },
                                          'Copied' => 1,
                                          'Header' => 'stl_list.h',
                                          'Line' => '106',
                                          'Memb' => {
                                                      '0' => {
                                                               'name' => '_M_data',
                                                               'offset' => '8',
                                                               'type' => '10951989'
                                                             }
                                                    },
                                          'Name' => 'struct std::_List_node<std::shared_ptr<unity::scopes::Link const> >',
                                          'NameSpace' => 'std',
                                          'Size' => '16',
                                          'TParam' => {
                                                        '0' => {
                                                                 'name' => 'std::shared_ptr<unity::scopes::Link const>'
                                                               }
                                                      },
                                          'Type' => 'Struct'
                                        },
                          '109613' => {
                                        'BaseType' => '105518',
                                        'Name' => 'unity::scopes::FilterState*',
                                        'Size' => '4',
                                        'Type' => 'Pointer'
                                      },
                          '109619' => {
                                        'BaseType' => '105879',
                                        'Name' => 'unity::scopes::FilterState const*',
                                        'Size' => '4',
                                        'Type' => 'Pointer'
                                      },
                          '109625' => {
                                        'BaseType' => '105879',
                                        'Name' => 'unity::scopes::FilterState const&',
                                        'Size' => '4',
                                        'Type' => 'Ref'
                                      },
                          '109631' => {
                                        'BaseType' => '105518',
                                        'Name' => 'unity::scopes::FilterState&&',
                                        'Size' => '4',
                                        'Type' => 'RvalueRef'
                                      },
                          '109637' => {
                                        'BaseType' => '105518',
                                        'Name' => 'unity::scopes::FilterState&',
                                        'Size' => '4',
                                        'Type' => 'Ref'
                                      },
                          '10964911' => {
                                          'Copied' => 1,
                                          'Header' => 'shared_ptr_base.h',
                                          'Line' => '867',
                                          'Memb' => {
                                                      '0' => {
                                                               'access' => 'private',
                                                               'name' => '_M_ptr',
                                                               'offset' => '0',
                                                               'type' => '10986333'
                                                             },
                                                      '1' => {
                                                               'access' => 'private',
                                                               'name' => '_M_refcount',
                                                               'offset' => '4',
                                                               'type' => '18021'
                                                             }
                                                    },
                                          'Name' => 'std::__shared_ptr<unity::scopes::Link const, 2>',
                                          'NameSpace' => 'std',
                                          'Size' => '8',
                                          'TParam' => {
                                                        '0' => {
                                                                 'name' => 'unity::scopes::Link const'
                                                               },
                                                        '1' => {
                                                                 'name' => '2'
                                                               }
                                                      },
                                          'Type' => 'Class'
                                        },
                          '109655' => {
                                        'BaseType' => '105460',
                                        'Name' => 'unity::scopes::internal::CannedQueryImpl*',
                                        'Size' => '4',
                                        'Type' => 'Pointer'
                                      },
                          '10972645' => {
                                          'Copied' => 1,
                                          'Header' => 'new_allocator.h',
                                          'Line' => '58',
                                          'Name' => 'struct __gnu_cxx::new_allocator<std::shared_ptr<unity::scopes::Link const> >',
                                          'NameSpace' => '__gnu_cxx',
                                          'Size' => '1',
                                          'TParam' => {
                                                        '0' => {
                                                                 'name' => 'std::shared_ptr<unity::scopes::Link const>'
                                                               }
                                                      },
                                          'Type' => 'Struct'
                                        },
                          '10972983' => {
                                          'Copied' => 1,
                                          'Header' => 'new_allocator.h',
                                          'Line' => '58',
                                          'Name' => 'struct __gnu_cxx::new_allocator<std::_List_node<std::shared_ptr<unity::scopes::Link const> > >',
                                          'NameSpace' => '__gnu_cxx',
                                          'Size' => '1',
                                          'TParam' => {
                                                        '0' => {
                                                                 'name' => 'std::_List_node<std::shared_ptr<unity::scopes::Link const> >'
                                                               }
                                                      },
                                          'Type' => 'Struct'
                                        },
                          '10983308' => {
                                          'Copied' => 1,
                                          'Header' => 'LinkImpl.h',
                                          'Line' => '35',
                                          'Memb' => {
                                                      '0' => {
                                                               'access' => 'private',
                                                               'name' => 'label_',
                                                               'offset' => '0',
                                                               'type' => '6675'
                                                             },
                                                      '1' => {
                                                               'access' => 'private',
                                                               'name' => 'query_',
                                                               'offset' => '24',
                                                               'type' => '11275590'
                                                             }
                                                    },
                                          'Name' => 'unity::scopes::internal::LinkImpl',
                                          'NameSpace' => 'unity::scopes::internal',
                                          'Size' => '32',
                                          'Type' => 'Class'
                                        },
                          '10983313' => {
                                          'Header' => 'AnnotationImpl.h',
                                          'Line' => '38',
                                          'Memb' => {
                                                      '0' => {
                                                               'name' => '_vptr',
                                                               'offset' => '0',
                                                               'type' => '45831'
                                                             },
                                                      '1' => {
                                                               'access' => 'private',
                                                               'name' => 'annotation_type_',
                                                               'offset' => '4',
                                                               'type' => '10985238'
                                                             },
                                                      '2' => {
                                                               'access' => 'private',
                                                               'name' => 'label_',
                                                               'offset' => '8',
                                                               'type' => '6675'
                                                             },
                                                      '3' => {
                                                               'access' => 'private',
                                                               'name' => 'icon_',
                                                               'offset' => '32',
                                                               'type' => '6675'
                                                             },
                                                      '4' => {
                                                               'access' => 'private',
                                                               'name' => 'links_',
                                                               'offset' => '56',
                                                               'type' => '10929883'
                                                             }
                                                    },
                                          'Name' => 'unity::scopes::internal::AnnotationImpl',
                                          'NameSpace' => 'unity::scopes::internal',
                                          'Size' => '68',
                                          'Type' => 'Class'
                                        },
                          '10984881' => {
                                          'Header' => 'Link.h',
                                          'Line' => '42',
                                          'Memb' => {
                                                      '0' => {
                                                               'access' => 'private',
                                                               'name' => 'p',
                                                               'offset' => '0',
                                                               'type' => '10949361'
                                                             }
                                                    },
                                          'Name' => 'unity::scopes::Link',
                                          'NameSpace' => 'unity::scopes',
                                          'Size' => '4',
                                          'Type' => 'Class'
                                        },
                          '10985219' => {
                                          'BaseType' => '10984881',
                                          'Name' => 'unity::scopes::Link const',
                                          'Size' => '4',
                                          'Type' => 'Const'
                                        },
                          '10985238' => {
                                          'BaseType' => '36582',
                                          'Header' => 'Annotation.h',
                                          'Line' => '61',
                                          'Memb' => {
                                                      '0' => {
                                                               'name' => 'Link',
                                                               'value' => '0'
                                                             },
                                                      '1' => {
                                                               'name' => 'GroupedLink',
                                                               'value' => '1'
                                                             }
                                                    },
                                          'Name' => 'enum unity::scopes::experimental::Annotation::Type',
                                          'NameSpace' => 'unity::scopes::experimental::Annotation',
                                          'Size' => '4',
                                          'Type' => 'Enum'
                                        },
                          '10986088' => {
                                          'BaseType' => '10983308',
                                          'Name' => 'unity::scopes::internal::LinkImpl*',
                                          'Size' => '4',
                                          'Type' => 'Pointer'
                                        },
                          '10986309' => {
                                          'BaseType' => '10984881',
                                          'Name' => 'unity::scopes::Link*',
                                          'Size' => '4',
                                          'Type' => 'Pointer'
                                        },
                          '10986315' => {
                                          'BaseType' => '10985219',
                                          'Name' => 'unity::scopes::Link const&',
                                          'Size' => '4',
                                          'Type' => 'Ref'
                                        },
                          '10986321' => {
                                          'BaseType' => '10984881',
                                          'Name' => 'unity::scopes::Link&&',
                                          'Size' => '4',
                                          'Type' => 'RvalueRef'
                                        },
                          '10986327' => {
                                          'BaseType' => '10984881',
                                          'Name' => 'unity::scopes::Link&',
                                          'Size' => '4',
                                          'Type' => 'Ref'
                                        },
                          '10986333' => {
                                          'BaseType' => '10985219',
                                          'Name' => 'unity::scopes::Link const*',
                                          'Size' => '4',
                                          'Type' => 'Pointer'
                                        },
                          '10986351' => {
                                          'BaseType' => '10983313',
                                          'Name' => 'unity::scopes::internal::AnnotationImpl*',
                                          'Size' => '4',
                                          'Type' => 'Pointer'
                                        },
                          '109876' => {
                                        'BaseType' => '105884',
                                        'Name' => 'unity::scopes::CannedQuery*',
                                        'Size' => '4',
                                        'Type' => 'Pointer'
                                      },
                          '109882' => {
                                        'BaseType' => '106559',
                                        'Name' => 'unity::scopes::CannedQuery const&',
                                        'Size' => '4',
                                        'Type' => 'Ref'
                                      },
                          '109888' => {
                                        'BaseType' => '105884',
                                        'Name' => 'unity::scopes::CannedQuery&&',
                                        'Size' => '4',
                                        'Type' => 'RvalueRef'
                                      },
                          '109894' => {
                                        'BaseType' => '105884',
                                        'Name' => 'unity::scopes::CannedQuery&',
                                        'Size' => '4',
                                        'Type' => 'Ref'
                                      },
                          '109900' => {
                                        'BaseType' => '106559',
                                        'Name' => 'unity::scopes::CannedQuery const*',
                                        'Size' => '4',
                                        'Type' => 'Pointer'
                                      },
                          '109918' => {
                                        'BaseType' => '105465',
                                        'Name' => 'unity::scopes::internal::DepartmentImpl*',
                                        'Size' => '4',
                                        'Type' => 'Pointer'
                                      },
                          '110139' => {
                                        'BaseType' => '106564',
                                        'Name' => 'unity::scopes::Department*',
                                        'Size' => '4',
                                        'Type' => 'Pointer'
                                      },
                          '110145' => {
                                        'BaseType' => '107206',
                                        'Name' => 'unity::scopes::Department const&',
                                        'Size' => '4',
                                        'Type' => 'Ref'
                                      },
                          '110151' => {
                                        'BaseType' => '106564',
                                        'Name' => 'unity::scopes::Department&&',
                                        'Size' => '4',
                                        'Type' => 'RvalueRef'
                                      },
                          '110157' => {
                                        'BaseType' => '106564',
                                        'Name' => 'unity::scopes::Department&',
                                        'Size' => '4',
                                        'Type' => 'Ref'
                                      },
                          '110163' => {
                                        'BaseType' => '107222',
                                        'Name' => 'unity::scopes::DepartmentList const&',
                                        'Size' => '4',
                                        'Type' => 'Ref'
                                      },
                          '110169' => {
                                        'BaseType' => '106903',
                                        'Name' => 'unity::scopes::Department::SCPtr const&',
                                        'Size' => '4',
                                        'Type' => 'Ref'
                                      },
                          '110175' => {
                                        'BaseType' => '107206',
                                        'Name' => 'unity::scopes::Department const*',
                                        'Size' => '4',
                                        'Type' => 'Pointer'
                                      },
                          '111131' => {
                                        'BaseType' => '107986',
                                        'Name' => 'unity::scopes::Category const*',
                                        'Size' => '4',
                                        'Type' => 'Pointer'
                                      },
                          '111337' => {
                                        'BaseType' => '36769',
                                        'Name' => 'void const**',
                                        'Size' => '4',
                                        'Type' => 'Pointer'
                                      },
                          '111361' => {
                                        'BaseType' => '109014',
                                        'Name' => 'unity::scopes::CategoryRenderer const&',
                                        'Size' => '4',
                                        'Type' => 'Ref'
                                      },
                          '111367' => {
                                        'BaseType' => '109035',
                                        'Name' => 'unity::scopes::experimental::Annotation const&',
                                        'Size' => '4',
                                        'Type' => 'Ref'
                                      },
                          '111373' => {
                                        'BaseType' => '109052',
                                        'Name' => 'unity::scopes::Filters const&',
                                        'Size' => '4',
                                        'Type' => 'Ref'
                                      },
                          '11226958' => {
                                          'Base' => {
                                                      '11365616' => {
                                                                      'pos' => '0'
                                                                    }
                                                    },
                                          'Copied' => 1,
                                          'Header' => 'shared_ptr.h',
                                          'Line' => '93',
                                          'Name' => 'std::shared_ptr<unity::scopes::CannedQuery const>',
                                          'NameSpace' => 'std',
                                          'Size' => '8',
                                          'TParam' => {
                                                        '0' => {
                                                                 'name' => 'unity::scopes::CannedQuery const'
                                                               }
                                                      },
                                          'Type' => 'Class'
                                        },
                          '11275590' => {
                                          'BaseType' => '11226958',
                                          'Header' => 'CannedQuery.h',
                                          'Line' => '53',
                                          'Name' => 'unity::scopes::CannedQuery::SCPtr',
                                          'NameSpace' => 'unity::scopes::CannedQuery',
                                          'Type' => 'Typedef'
                                        },
                          '11276257' => {
                                          'BaseType' => '11275590',
                                          'Name' => 'unity::scopes::CannedQuery::SCPtr const',
                                          'Type' => 'Const'
                                        },
                          '11298465' => {
                                          'BaseType' => '11276257',
                                          'Name' => 'unity::scopes::CannedQuery::SCPtr const&',
                                          'Size' => '4',
                                          'Type' => 'Ref'
                                        },
                          '1131031' => {
                                         'Base' => {
                                                     '14305583' => {
                                                                     'pos' => '0'
                                                                   }
                                                   },
                                         'Copied' => 1,
                                         'Header' => 'stl_function.h',
                                         'Line' => '883',
                                         'Name' => 'struct std::_Select1st<std::pair<unity::scopes::internal::MiddlewareFactory::MiddlewareData const, std::shared_ptr<unity::scopes::internal::MiddlewareBase> > >',
                                         'NameSpace' => 'std',
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'name' => 'std::pair<unity::scopes::internal::MiddlewareFactory::MiddlewareData const, std::shared_ptr<unity::scopes::internal::MiddlewareBase> >'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '11365616' => {
                                          'Copied' => 1,
                                          'Header' => 'shared_ptr_base.h',
                                          'Line' => '867',
                                          'Memb' => {
                                                      '0' => {
                                                               'access' => 'private',
                                                               'name' => '_M_ptr',
                                                               'offset' => '0',
                                                               'type' => '109900'
                                                             },
                                                      '1' => {
                                                               'access' => 'private',
                                                               'name' => '_M_refcount',
                                                               'offset' => '4',
                                                               'type' => '18021'
                                                             }
                                                    },
                                          'Name' => 'std::__shared_ptr<unity::scopes::CannedQuery const, 2>',
                                          'NameSpace' => 'std',
                                          'Size' => '8',
                                          'TParam' => {
                                                        '0' => {
                                                                 'name' => 'unity::scopes::CannedQuery const'
                                                               },
                                                        '1' => {
                                                                 'name' => '2'
                                                               }
                                                      },
                                          'Type' => 'Class'
                                        },
                          '11389254' => {
                                          'Header' => 'CategoryImpl.h',
                                          'Line' => '37',
                                          'Memb' => {
                                                      '0' => {
                                                               'access' => 'private',
                                                               'name' => 'id_',
                                                               'offset' => '0',
                                                               'type' => '6675'
                                                             },
                                                      '1' => {
                                                               'access' => 'private',
                                                               'name' => 'title_',
                                                               'offset' => '24',
                                                               'type' => '6675'
                                                             },
                                                      '2' => {
                                                               'access' => 'private',
                                                               'name' => 'icon_',
                                                               'offset' => '48',
                                                               'type' => '6675'
                                                             },
                                                      '3' => {
                                                               'access' => 'private',
                                                               'name' => 'query_',
                                                               'offset' => '72',
                                                               'type' => '11275590'
                                                             },
                                                      '4' => {
                                                               'access' => 'private',
                                                               'name' => 'renderer_template_',
                                                               'offset' => '80',
                                                               'type' => '109009'
                                                             }
                                                    },
                                          'Name' => 'unity::scopes::internal::CategoryImpl',
                                          'NameSpace' => 'unity::scopes::internal',
                                          'Size' => '88',
                                          'Type' => 'Class'
                                        },
                          '11391787' => {
                                          'BaseType' => '11389254',
                                          'Name' => 'unity::scopes::internal::CategoryImpl*',
                                          'Size' => '4',
                                          'Type' => 'Pointer'
                                        },
                          '1140640' => {
                                         'Copied' => 1,
                                         'Header' => 'new_allocator.h',
                                         'Line' => '58',
                                         'Name' => 'struct __gnu_cxx::new_allocator<std::pair<unity::scopes::internal::MiddlewareFactory::MiddlewareData const, std::shared_ptr<unity::scopes::internal::MiddlewareBase> > >',
                                         'NameSpace' => '__gnu_cxx',
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'name' => 'std::pair<unity::scopes::internal::MiddlewareFactory::MiddlewareData const, std::shared_ptr<unity::scopes::internal::MiddlewareBase> >'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '1141207' => {
                                         'Copied' => 1,
                                         'Header' => 'new_allocator.h',
                                         'Line' => '58',
                                         'Name' => 'struct __gnu_cxx::new_allocator<std::_Rb_tree_node<std::pair<unity::scopes::internal::MiddlewareFactory::MiddlewareData const, std::shared_ptr<unity::scopes::internal::MiddlewareBase> > > >',
                                         'NameSpace' => '__gnu_cxx',
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'name' => 'std::_Rb_tree_node<std::pair<unity::scopes::internal::MiddlewareFactory::MiddlewareData const, std::shared_ptr<unity::scopes::internal::MiddlewareBase> > >'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '1141545' => {
                                         'Copied' => 1,
                                         'Header' => 'new_allocator.h',
                                         'Line' => '58',
                                         'Name' => 'struct __gnu_cxx::new_allocator<unity::scopes::internal::reaper_private::Item>',
                                         'NameSpace' => '__gnu_cxx',
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'name' => 'unity::scopes::internal::reaper_private::Item'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '1141883' => {
                                         'Copied' => 1,
                                         'Header' => 'new_allocator.h',
                                         'Line' => '58',
                                         'Name' => 'struct __gnu_cxx::new_allocator<std::_List_node<unity::scopes::internal::reaper_private::Item> >',
                                         'NameSpace' => '__gnu_cxx',
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'name' => 'std::_List_node<unity::scopes::internal::reaper_private::Item>'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '1142221' => {
                                         'Copied' => 1,
                                         'Header' => 'new_allocator.h',
                                         'Line' => '58',
                                         'Name' => 'struct __gnu_cxx::new_allocator<std::thread>',
                                         'NameSpace' => '__gnu_cxx',
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'name' => 'std::thread'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '1142559' => {
                                         'Base' => {
                                                     '995050' => {
                                                                   'pos' => '0'
                                                                 }
                                                   },
                                         'Copied' => 1,
                                         'Header' => 'alloc_traits.h',
                                         'Line' => '95',
                                         'Name' => 'struct __gnu_cxx::__alloc_traits<std::allocator<std::thread> >',
                                         'NameSpace' => '__gnu_cxx',
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'name' => 'std::allocator<std::thread>'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '1142609' => {
                                         'BaseType' => '995085',
                                         'Header' => 'alloc_traits.h',
                                         'Line' => '104',
                                         'Name' => '__gnu_cxx::__alloc_traits<std::allocator<std::thread> >::pointer',
                                         'NameSpace' => '__gnu_cxx::__alloc_traits<std::allocator<std::thread> >',
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '1142847' => {
                                         'Copied' => 1,
                                         'Header' => 'new_allocator.h',
                                         'Line' => '58',
                                         'Name' => 'struct __gnu_cxx::new_allocator<unity::scopes::internal::TaskWrapper>',
                                         'NameSpace' => '__gnu_cxx',
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'name' => 'unity::scopes::internal::TaskWrapper'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '1143507' => {
                                         'Copied' => 1,
                                         'Header' => 'new_allocator.h',
                                         'Line' => '58',
                                         'Name' => 'struct __gnu_cxx::new_allocator<std::future<void> >',
                                         'NameSpace' => '__gnu_cxx',
                                         'Size' => '1',
                                         'TParam' => {
                                                       '0' => {
                                                                'name' => 'std::future<void>'
                                                              }
                                                     },
                                         'Type' => 'Struct'
                                       },
                          '11490487' => {
                                          'BaseType' => '43742',
                                          'Name' => 'unity::scopes::Category*',
                                          'Size' => '4',
                                          'Type' => 'Pointer'
                                        },
                          '11547688' => {
                                          'BaseType' => '11547727',
                                          'Name' => 'unity::scopes::internal::CategoryRendererImpl*',
                                          'Size' => '4',
                                          'Type' => 'Pointer'
                                        },
                          '11547727' => {
                                          'Header' => 'CategoryRendererImpl.h',
                                          'Line' => '33',
                                          'Memb' => {
                                                      '0' => {
                                                               'access' => 'private',
                                                               'name' => 'data_',
                                                               'offset' => '0',
                                                               'type' => '6675'
                                                             }
                                                    },
                                          'Name' => 'unity::scopes::internal::CategoryRendererImpl',
                                          'NameSpace' => 'unity::scopes::internal',
                                          'Size' => '24',
                                          'Type' => 'Class'
                                        },
                          '11597305' => {
                                          'Copied' => 1,
                                          'Header' => 'stl_pair.h',
                                          'Line' => '96',
                                          'Memb' => {
                                                      '0' => {
                                                               'name' => 'first',
                                                               'offset' => '0',
                                                               'type' => '6670'
                                                             },
                                                      '1' => {
                                                               'name' => 'second',
                                                               'offset' => '24',
                                                               'type' => '36673'
                                                             }
                                                    },
                                          'Name' => 'struct std::pair<std::__cxx11::basic_string<char>const, bool>',
                                          'NameSpace' => 'std',
                                          'Size' => '28',
                                          'TParam' => {
                                                        '0' => {
                                                                 'name' => 'std::__cxx11::basic_string<char>const'
                                                               },
                                                        '1' => {
                                                                 'name' => 'bool'
                                                               }
                                                      },
                                          'Type' => 'Struct'
                                        },
                          '11597670' => {
                                          'Base' => {
                                                      '11624306' => {
                                                                      'pos' => '0'
                                                                    }
                                                    },
                                          'Copied' => 1,
                                          'Header' => 'allocator.h',
                                          'Line' => '92',
                                          'Name' => 'std::allocator<std::pair<const std::__cxx11::basic_string<char, std::char_traits<char>, std::allocator<char> >, bool> >',
                                          'NameSpace' => 'std',
                                          'Size' => '1',
                                          'TParam' => {
                                                        '0' => {
                                                                 'name' => 'std::pair<const std::__cxx11::basic_string<char, std::char_traits<char>, std::allocator<char> >, bool>'
                                                               }
                                                      },
                                          'Type' => 'Class'
                                        },
                          '11598446' => {
                                          'Base' => {
                                                      '11624873' => {
                                                                      'pos' => '0'
                                                                    }
                                                    },
                                          'Copied' => 1,
                                          'Header' => 'allocator.h',
                                          'Line' => '92',
                                          'Name' => 'std::allocator<std::_Rb_tree_node<std::pair<const std::__cxx11::basic_string<char, std::char_traits<char>, std::allocator<char> >, bool> > >',
                                          'NameSpace' => 'std',
                                          'Size' => '1',
                                          'TParam' => {
                                                        '0' => {
                                                                 'name' => 'std::_Rb_tree_node<std::pair<const std::__cxx11::basic_string<char, std::char_traits<char>, std::allocator<char> >, bool> >'
                                                               }
                                                      },
                                          'Type' => 'Class'
                                        },
                          '11598628' => {
                                          'Base' => {
                                                      '219502' => {
                                                                    'pos' => '0'
                                                                  }
                                                    },
                                          'Copied' => 1,
                                          'Header' => 'stl_tree.h',
                                          'Line' => '134',
                                          'Memb' => {
                                                      '0' => {
                                                               'name' => '_M_storage',
                                                               'offset' => '16',
                                                               'type' => '11626839'
                                                             }
                                                    },
                                          'Name' => 'struct std::_Rb_tree_node<std::pair<std::__cxx11::basic_string<char>const, bool> >',
                                          'NameSpace' => 'std',
                                          'Size' => '44',
                                          'TParam' => {
                                                        '0' => {
                                                                 'name' => 'std::pair<std::__cxx11::basic_string<char>const, bool>'
                                                               }
                                                      },
                                          'Type' => 'Struct'
                                        },
                          '11598759' => {
                                          'Copied' => 1,
                                          'Header' => 'stl_tree.h',
                                          'Line' => '347',
                                          'Memb' => {
                                                      '0' => {
                                                               'access' => 'protected',
                                                               'name' => '_M_impl',
                                                               'offset' => '0',
                                                               'type' => '11598772'
                                                             }
                                                    },
                                          'Name' => 'std::_Rb_tree<std::__cxx11::basic_string<char>, std::pair<std::__cxx11::basic_string<char>const, bool>, std::_Select1st<std::pair<std::__cxx11::basic_string<char>const, bool> >, std::less<std::__cxx11::basic_string<char> >, std::allocator<std::pair<const std::__cxx11::basic_string<char, std::char_traits<char>, std::allocator<char> >, bool> > >',
                                          'NameSpace' => 'std',
                                          'Size' => '24',
                                          'TParam' => {
                                                        '0' => {
                                                                 'name' => 'std::__cxx11::basic_string<char>'
                                                               },
                                                        '1' => {
                                                                 'name' => 'std::pair<std::__cxx11::basic_string<char>const, bool>'
                                                               },
                                                        '2' => {
                                                                 'name' => 'std::_Select1st<std::pair<std::__cxx11::basic_string<char>const, bool> >'
                                                               },
                                                        '3' => {
                                                                 'name' => 'std::less<std::__cxx11::basic_string<char> >'
                                                               },
                                                        '4' => {
                                                                 'name' => 'std::allocator<std::pair<const std::__cxx11::basic_string<char, std::char_traits<char>, std::allocator<char> >, bool> >'
                                                               }
                                                      },
                                          'Type' => 'Class'
                                        },
                          '11598772' => {
                                          'Base' => {
                                                      '11598446' => {
                                                                      'pos' => '0'
                                                                    }
                                                    },
                                          'Copied' => 1,
                                          'Header' => 'stl_tree.h',
                                          'Line' => '580',
                                          'Memb' => {
                                                      '0' => {
                                                               'name' => '_M_key_compare',
                                                               'offset' => '0',
                                                               'type' => '221303'
                                                             },
                                                      '1' => {
                                                               'name' => '_M_header',
                                                               'offset' => '4',
                                                               'type' => '219502'
                                                             },
                                                      '2' => {
                                                               'name' => '_M_node_count',
                                                               'offset' => '20',
                                                               'type' => '11599020'
                                                             }
                                                    },
                                          'Name' => 'struct std::_Rb_tree<std::__cxx11::basic_string<char>, std::pair<std::__cxx11::basic_string<char>const, bool>, std::_Select1st<std::pair<std::__cxx11::basic_string<char>const, bool> >, std::less<std::__cxx11::basic_string<char> >, std::allocator<std::pair<const std::__cxx11::basic_string<char, std::char_traits<char>, std::allocator<char> >, bool> > >::_Rb_tree_impl<std::less<std::__cxx11::basic_string<char> > >',
                                          'NameSpace' => 'std::_Rb_tree<std::__cxx11::basic_string<char>, std::pair<std::__cxx11::basic_string<char>const, bool>, std::_Select1st<std::pair<std::__cxx11::basic_string<char>const, bool> >, std::less<std::__cxx11::basic_string<char> >, std::allocator<std::pair<const std::__cxx11::basic_string<char, std::char_traits<char>, std::allocator<char> >, bool> > >',
                                          'Protected' => 1,
                                          'Size' => '24',
                                          'TParam' => {
                                                        '0' => {
                                                                 'name' => 'std::less<std::__cxx11::basic_string<char> >'
                                                               }
                                                      },
                                          'Type' => 'Struct'
                                        },
                          '11599020' => {
                                          'BaseType' => '7493',
                                          'Header' => 'stl_tree.h',
                                          'Line' => '472',
                                          'Name' => 'std::_Rb_tree<std::__cxx11::basic_string<char>, std::pair<std::__cxx11::basic_string<char>const, bool>, std::_Select1st<std::pair<std::__cxx11::basic_string<char>const, bool> >, std::less<std::__cxx11::basic_string<char> >, std::allocator<std::pair<const std::__cxx11::basic_string<char, std::char_traits<char>, std::allocator<char> >, bool> > >::size_type',
                                          'NameSpace' => 'std::_Rb_tree<std::__cxx11::basic_string<char>, std::pair<std::__cxx11::basic_string<char>const, bool>, std::_Select1st<std::pair<std::__cxx11::basic_string<char>const, bool> >, std::less<std::__cxx11::basic_string<char> >, std::allocator<std::pair<const std::__cxx11::basic_string<char, std::char_traits<char>, std::allocator<char> >, bool> > >',
                                          'Size' => '4',
                                          'Type' => 'Typedef'
                                        },
                          '11603894' => {
                                          'Copied' => 1,
                                          'Header' => 'stl_map.h',
                                          'Line' => '96',
                                          'Memb' => {
                                                      '0' => {
                                                               'access' => 'private',
                                                               'name' => '_M_t',
                                                               'offset' => '0',
                                                               'type' => '11603906'
                                                             }
                                                    },
                                          'Name' => 'std::map<std::__cxx11::basic_string<char>, bool>',
                                          'NameSpace' => 'std',
                                          'Size' => '24',
                                          'TParam' => {
                                                        '0' => {
                                                                 'name' => 'std::__cxx11::basic_string<char>'
                                                               },
                                                        '1' => {
                                                                 'name' => 'bool'
                                                               }
                                                      },
                                          'Type' => 'Class'
                                        },
                          '11603906' => {
                                          'BaseType' => '11598759',
                                          'Header' => 'stl_map.h',
                                          'Line' => '135',
                                          'Name' => 'std::map<std::__cxx11::basic_string<char>, bool>::_Rep_type',
                                          'NameSpace' => 'std::map<std::__cxx11::basic_string<char>, bool>',
                                          'Private' => 1,
                                          'Size' => '24',
                                          'Type' => 'Typedef'
                                        },
                          '11609' => {
                                       'Base' => {
                                                   '10777' => {
                                                                'pos' => '0'
                                                              }
                                                 },
                                       'Copied' => 1,
                                       'Line' => '55',
                                       'Name' => 'struct std::_Head_base<1u, std::default_delete<unity::scopes::internal::OperationInfoImpl>, true>',
                                       'NameSpace' => 'std',
                                       'Size' => '1',
                                       'Source' => 'tuple',
                                       'TParam' => {
                                                     '0' => {
                                                              'name' => '1u'
                                                            },
                                                     '1' => {
                                                              'name' => 'std::default_delete<unity::scopes::internal::OperationInfoImpl>'
                                                            },
                                                     '2' => {
                                                              'name' => 'true'
                                                            }
                                                   },
                                       'Type' => 'Struct'
                                     },
                          '11616187' => {
                                          'Header' => 'stl_function.h',
                                          'Line' => '105',
                                          'Name' => 'struct std::unary_function<std::pair<std::__cxx11::basic_string<char>const, bool>, std::__cxx11::basic_string<char>const>',
                                          'NameSpace' => 'std',
                                          'Size' => '1',
                                          'TParam' => {
                                                        '0' => {
                                                                 'name' => 'std::pair<std::__cxx11::basic_string<char>const, bool>'
                                                               },
                                                        '1' => {
                                                                 'name' => 'std::__cxx11::basic_string<char>const'
                                                               }
                                                      },
                                          'Type' => 'Struct'
                                        },
                          '11616218' => {
                                          'Base' => {
                                                      '11616187' => {
                                                                      'pos' => '0'
                                                                    }
                                                    },
                                          'Copied' => 1,
                                          'Header' => 'stl_function.h',
                                          'Line' => '883',
                                          'Name' => 'struct std::_Select1st<std::pair<std::__cxx11::basic_string<char>const, bool> >',
                                          'NameSpace' => 'std',
                                          'Size' => '1',
                                          'TParam' => {
                                                        '0' => {
                                                                 'name' => 'std::pair<std::__cxx11::basic_string<char>const, bool>'
                                                               }
                                                      },
                                          'Type' => 'Struct'
                                        },
                          '11624306' => {
                                          'Copied' => 1,
                                          'Header' => 'new_allocator.h',
                                          'Line' => '58',
                                          'Name' => 'struct __gnu_cxx::new_allocator<std::pair<std::__cxx11::basic_string<char>const, bool> >',
                                          'NameSpace' => '__gnu_cxx',
                                          'Size' => '1',
                                          'TParam' => {
                                                        '0' => {
                                                                 'name' => 'std::pair<std::__cxx11::basic_string<char>const, bool>'
                                                               }
                                                      },
                                          'Type' => 'Struct'
                                        },
                          '11624873' => {
                                          'Copied' => 1,
                                          'Header' => 'new_allocator.h',
                                          'Line' => '58',
                                          'Name' => 'struct __gnu_cxx::new_allocator<std::_Rb_tree_node<std::pair<std::__cxx11::basic_string<char>const, bool> > >',
                                          'NameSpace' => '__gnu_cxx',
                                          'Size' => '1',
                                          'TParam' => {
                                                        '0' => {
                                                                 'name' => 'std::_Rb_tree_node<std::pair<std::__cxx11::basic_string<char>const, bool> >'
                                                               }
                                                      },
                                          'Type' => 'Struct'
                                        },
                          '11626839' => {
                                          'Copied' => 1,
                                          'Header' => 'aligned_buffer.h',
                                          'Line' => '47',
                                          'Memb' => {
                                                      '0' => {
                                                               'name' => '_M_storage',
                                                               'offset' => '0',
                                                               'type' => '692704'
                                                             }
                                                    },
                                          'Name' => 'struct __gnu_cxx::__aligned_membuf<std::pair<std::__cxx11::basic_string<char>const, bool> >',
                                          'NameSpace' => '__gnu_cxx',
                                          'Size' => '28',
                                          'TParam' => {
                                                        '0' => {
                                                                 'name' => 'std::pair<std::__cxx11::basic_string<char>const, bool>'
                                                               }
                                                      },
                                          'Type' => 'Struct'
                                        },
                          '11634555' => {
                                          'Header' => 'ChildScopesRepository.h',
                                          'Line' => '40',
                                          'Memb' => {
                                                      '0' => {
                                                               'access' => 'private',
                                                               'name' => 'repo_file_path_',
                                                               'offset' => '0',
                                                               'type' => '6686'
                                                             },
                                                      '1' => {
                                                               'access' => 'private',
                                                               'name' => 'logger_',
                                                               'offset' => '24',
                                                               'type' => '692942'
                                                             },
                                                      '2' => {
                                                               'access' => 'private',
                                                               'name' => 'mutex_',
                                                               'offset' => '28',
                                                               'type' => '85619'
                                                             },
                                                      '3' => {
                                                               'access' => 'private',
                                                               'name' => 'cached_repo_',
                                                               'offset' => '52',
                                                               'type' => '11634928'
                                                             },
                                                      '4' => {
                                                               'access' => 'private',
                                                               'name' => 'have_latest_cache_',
                                                               'offset' => '76',
                                                               'type' => '36673'
                                                             }
                                                    },
                                          'Name' => 'unity::scopes::internal::ChildScopesRepository',
                                          'NameSpace' => 'unity::scopes::internal',
                                          'Size' => '80',
                                          'Type' => 'Class'
                                        },
                          '11634928' => {
                                          'BaseType' => '11603894',
                                          'Header' => 'ChildScopesRepository.h',
                                          'Line' => '38',
                                          'Name' => 'unity::scopes::internal::ChildScopeEnabledMap',
                                          'NameSpace' => 'unity::scopes::internal',
                                          'Size' => '24',
                                          'Type' => 'Typedef'
                                        },
                          '116504' => {
                                        'BaseType' => '111337',
                                        'Name' => 'void const**const',
                                        'Size' => '4',
                                        'Type' => 'Const'
                                      },
                          '1165556' => {
                                         'BaseType' => '36638',
                                         'Header' => 'types.h',
                                         'Line' => '175',
                                         'Name' => '__syscall_slong_t',
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '1165900' => {
                                         'Header' => 'pthreadtypes.h',
                                         'Line' => '140',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => '__data',
                                                              'offset' => '0',
                                                              'type' => '1165913'
                                                            },
                                                     '1' => {
                                                              'name' => '__size',
                                                              'offset' => '0',
                                                              'type' => '1166053'
                                                            },
                                                     '2' => {
                                                              'name' => '__align',
                                                              'offset' => '0',
                                                              'type' => '36645'
                                                            }
                                                   },
                                         'Name' => 'union pthread_cond_t',
                                         'Size' => '48',
                                         'Type' => 'Union'
                                       },
                          '1165913' => {
                                         'Header' => 'pthreadtypes.h',
                                         'Line' => '142',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => '__lock',
                                                              'offset' => '0',
                                                              'type' => '36631'
                                                            },
                                                     '1' => {
                                                              'name' => '__futex',
                                                              'offset' => '4',
                                                              'type' => '36582'
                                                            },
                                                     '2' => {
                                                              'name' => '__total_seq',
                                                              'offset' => '8',
                                                              'type' => '36610'
                                                            },
                                                     '3' => {
                                                              'name' => '__wakeup_seq',
                                                              'offset' => '16',
                                                              'type' => '36610'
                                                            },
                                                     '4' => {
                                                              'name' => '__woken_seq',
                                                              'offset' => '24',
                                                              'type' => '36610'
                                                            },
                                                     '5' => {
                                                              'name' => '__mutex',
                                                              'offset' => '32',
                                                              'type' => '36721'
                                                            },
                                                     '6' => {
                                                              'name' => '__nwaiters',
                                                              'offset' => '36',
                                                              'type' => '36582'
                                                            },
                                                     '7' => {
                                                              'name' => '__broadcast_seq',
                                                              'offset' => '40',
                                                              'type' => '36582'
                                                            }
                                                   },
                                         'Name' => 'anon-struct-pthreadtypes.h-142',
                                         'Size' => '44',
                                         'Type' => 'Struct'
                                       },
                          '1166053' => {
                                         'BaseType' => '36783',
                                         'Name' => 'char[48]',
                                         'Size' => '48',
                                         'Type' => 'Array'
                                       },
                          '1166071' => {
                                         'BaseType' => '1165900',
                                         'Header' => 'pthreadtypes.h',
                                         'Line' => '154',
                                         'Name' => 'pthread_cond_t',
                                         'Size' => '48',
                                         'Type' => 'Typedef'
                                       },
                          '1166381' => {
                                         'BaseType' => '1166071',
                                         'Header' => 'gthr-default.h',
                                         'Line' => '52',
                                         'Name' => '__gthread_cond_t',
                                         'Size' => '48',
                                         'Type' => 'Typedef'
                                       },
                          '11682516' => {
                                          'BaseType' => '11634555',
                                          'Name' => 'unity::scopes::internal::ChildScopesRepository*',
                                          'Size' => '4',
                                          'Type' => 'Pointer'
                                        },
                          '11682838' => {
                                          'BaseType' => '2894758',
                                          'Name' => 'struct unity::scopes::ChildScope const*const',
                                          'Size' => '4',
                                          'Type' => 'Const'
                                        },
                          '1170863' => {
                                         'Copied' => 1,
                                         'Header' => 'FilterBaseImpl.h',
                                         'Line' => '35',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => '_vptr',
                                                              'offset' => '0',
                                                              'type' => '45831'
                                                            },
                                                     '1' => {
                                                              'access' => 'private',
                                                              'name' => 'id_',
                                                              'offset' => '4',
                                                              'type' => '6675'
                                                            },
                                                     '2' => {
                                                              'access' => 'private',
                                                              'name' => 'display_hints_',
                                                              'offset' => '28',
                                                              'type' => '36631'
                                                            }
                                                   },
                                         'Name' => 'unity::scopes::internal::FilterBaseImpl',
                                         'NameSpace' => 'unity::scopes::internal',
                                         'Size' => '32',
                                         'Type' => 'Class'
                                       },
                          '1171575' => {
                                         'BaseType' => '947499',
                                         'Header' => 'Logger.h',
                                         'Line' => '62',
                                         'Name' => 'unity::scopes::internal::Logger::UPtr',
                                         'NameSpace' => 'unity::scopes::internal::Logger',
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '1172051' => {
                                         'Copied' => 1,
                                         'Header' => 'MiddlewareBase.h',
                                         'Line' => '53',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => '_vptr',
                                                              'offset' => '0',
                                                              'type' => '45831'
                                                            },
                                                     '1' => {
                                                              'access' => 'private',
                                                              'name' => 'runtime_',
                                                              'offset' => '4',
                                                              'type' => '1270053'
                                                            }
                                                   },
                                         'Name' => 'unity::scopes::internal::MiddlewareBase',
                                         'NameSpace' => 'unity::scopes::internal',
                                         'Size' => '8',
                                         'Type' => 'Class'
                                       },
                          '1172060' => {
                                         'BaseType' => '973792',
                                         'Header' => 'MiddlewareBase.h',
                                         'Line' => '57',
                                         'Name' => 'unity::scopes::internal::MiddlewareBase::SPtr',
                                         'NameSpace' => 'unity::scopes::internal::MiddlewareBase',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1172073' => {
                                         'Header' => 'MiddlewareFactory.h',
                                         'Line' => '40',
                                         'Memb' => {
                                                     '0' => {
                                                              'access' => 'private',
                                                              'name' => 'runtime_',
                                                              'offset' => '0',
                                                              'type' => '1270053'
                                                            },
                                                     '1' => {
                                                              'access' => 'private',
                                                              'name' => 'mw_map_',
                                                              'offset' => '4',
                                                              'type' => '971822'
                                                            },
                                                     '2' => {
                                                              'access' => 'private',
                                                              'name' => 'mutex_',
                                                              'offset' => '28',
                                                              'type' => '85619'
                                                            }
                                                   },
                                         'Name' => 'unity::scopes::internal::MiddlewareFactory',
                                         'NameSpace' => 'unity::scopes::internal',
                                         'Size' => '52',
                                         'Type' => 'Class'
                                       },
                          '1172114' => {
                                         'Header' => 'MiddlewareFactory.h',
                                         'Line' => '67',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'server_name',
                                                              'offset' => '0',
                                                              'type' => '6675'
                                                            },
                                                     '1' => {
                                                              'name' => 'kind',
                                                              'offset' => '24',
                                                              'type' => '6675'
                                                            }
                                                   },
                                         'Name' => 'struct unity::scopes::internal::MiddlewareFactory::MiddlewareData',
                                         'NameSpace' => 'unity::scopes::internal::MiddlewareFactory',
                                         'Private' => 1,
                                         'Size' => '48',
                                         'Type' => 'Struct'
                                       },
                          '1172205' => {
                                         'BaseType' => '1172114',
                                         'Name' => 'struct unity::scopes::internal::MiddlewareFactory::MiddlewareData const',
                                         'Size' => '48',
                                         'Type' => 'Const'
                                       },
                          '1172246' => {
                                         'BaseType' => '974064',
                                         'Header' => 'MiddlewareFactory.h',
                                         'Line' => '44',
                                         'Name' => 'unity::scopes::internal::MiddlewareFactory::UPtr',
                                         'NameSpace' => 'unity::scopes::internal::MiddlewareFactory',
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '1172570' => {
                                         'Header' => 'RuntimeImpl.h',
                                         'Line' => '37',
                                         'Memb' => {
                                                     '0' => {
                                                              'access' => 'private',
                                                              'name' => 'destroyed_',
                                                              'offset' => '0',
                                                              'type' => '36673'
                                                            },
                                                     '1' => {
                                                              'access' => 'private',
                                                              'name' => 'scope_id_',
                                                              'offset' => '4',
                                                              'type' => '6675'
                                                            },
                                                     '10' => {
                                                               'access' => 'private',
                                                               'name' => 'reap_expiry_',
                                                               'offset' => '168',
                                                               'type' => '36631'
                                                             },
                                                     '11' => {
                                                               'access' => 'private',
                                                               'name' => 'reap_interval_',
                                                               'offset' => '172',
                                                               'type' => '36631'
                                                             },
                                                     '12' => {
                                                               'access' => 'private',
                                                               'name' => 'cache_dir_',
                                                               'offset' => '176',
                                                               'type' => '6675'
                                                             },
                                                     '13' => {
                                                               'access' => 'private',
                                                               'name' => 'app_dir_',
                                                               'offset' => '200',
                                                               'type' => '6675'
                                                             },
                                                     '14' => {
                                                               'access' => 'private',
                                                               'name' => 'log_dir_',
                                                               'offset' => '224',
                                                               'type' => '6675'
                                                             },
                                                     '15' => {
                                                               'access' => 'private',
                                                               'name' => 'config_dir_',
                                                               'offset' => '248',
                                                               'type' => '6675'
                                                             },
                                                     '16' => {
                                                               'access' => 'private',
                                                               'name' => 'logger_',
                                                               'offset' => '272',
                                                               'type' => '1171575'
                                                             },
                                                     '17' => {
                                                               'access' => 'private',
                                                               'name' => 'reply_reaper_',
                                                               'offset' => '276',
                                                               'type' => '1174521'
                                                             },
                                                     '18' => {
                                                               'access' => 'private',
                                                               'name' => 'async_pool_',
                                                               'offset' => '284',
                                                               'type' => '1175969'
                                                             },
                                                     '19' => {
                                                               'access' => 'private',
                                                               'name' => 'future_queue_',
                                                               'offset' => '292',
                                                               'type' => '1176294'
                                                             },
                                                     '2' => {
                                                              'access' => 'private',
                                                              'name' => 'middleware_factory_',
                                                              'offset' => '28',
                                                              'type' => '1172246'
                                                            },
                                                     '20' => {
                                                               'access' => 'private',
                                                               'name' => 'waiter_thread_',
                                                               'offset' => '300',
                                                               'type' => '188831'
                                                             },
                                                     '21' => {
                                                               'access' => 'private',
                                                               'name' => 'mutex_',
                                                               'offset' => '304',
                                                               'type' => '85619'
                                                             },
                                                     '3' => {
                                                              'access' => 'private',
                                                              'name' => 'middleware_',
                                                              'offset' => '32',
                                                              'type' => '1172060'
                                                            },
                                                     '4' => {
                                                              'access' => 'private',
                                                              'name' => 'registry_',
                                                              'offset' => '40',
                                                              'type' => '1180129'
                                                            },
                                                     '5' => {
                                                              'access' => 'private',
                                                              'name' => 'runtime_configfile_',
                                                              'offset' => '48',
                                                              'type' => '6675'
                                                            },
                                                     '6' => {
                                                              'access' => 'private',
                                                              'name' => 'registry_configfile_',
                                                              'offset' => '72',
                                                              'type' => '6675'
                                                            },
                                                     '7' => {
                                                              'access' => 'private',
                                                              'name' => 'registry_identity_',
                                                              'offset' => '96',
                                                              'type' => '6675'
                                                            },
                                                     '8' => {
                                                              'access' => 'private',
                                                              'name' => 'ss_configfile_',
                                                              'offset' => '120',
                                                              'type' => '6675'
                                                            },
                                                     '9' => {
                                                              'access' => 'private',
                                                              'name' => 'ss_registry_identity_',
                                                              'offset' => '144',
                                                              'type' => '6675'
                                                            }
                                                   },
                                         'Name' => 'unity::scopes::internal::RuntimeImpl',
                                         'NameSpace' => 'unity::scopes::internal',
                                         'Size' => '328',
                                         'Type' => 'Class'
                                       },
                          '1173875' => {
                                         'Header' => 'Reaper.h',
                                         'Line' => '90',
                                         'Memb' => {
                                                     '0' => {
                                                              'access' => 'private',
                                                              'name' => 'reaper_',
                                                              'offset' => '0',
                                                              'type' => '979901'
                                                            },
                                                     '1' => {
                                                              'access' => 'private',
                                                              'name' => 'it_',
                                                              'offset' => '8',
                                                              'type' => '881102'
                                                            },
                                                     '2' => {
                                                              'access' => 'private',
                                                              'name' => 'cancelled_',
                                                              'offset' => '12',
                                                              'type' => '36673'
                                                            },
                                                     '3' => {
                                                              'access' => 'private',
                                                              'name' => 'mutex_',
                                                              'offset' => '16',
                                                              'type' => '85619'
                                                            }
                                                   },
                                         'Name' => 'unity::scopes::internal::ReapItem',
                                         'NameSpace' => 'unity::scopes::internal',
                                         'Size' => '40',
                                         'Type' => 'Class'
                                       },
                          '1174142' => {
                                         'Header' => 'Reaper.h',
                                         'Line' => '46',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'cb',
                                                              'offset' => '0',
                                                              'type' => '1174304'
                                                            },
                                                     '1' => {
                                                              'name' => 'timestamp',
                                                              'offset' => '16',
                                                              'type' => '920260'
                                                            },
                                                     '2' => {
                                                              'name' => 'reap_item',
                                                              'offset' => '24',
                                                              'type' => '977868'
                                                            }
                                                   },
                                         'Name' => 'struct unity::scopes::internal::reaper_private::Item',
                                         'NameSpace' => 'unity::scopes::internal::reaper_private',
                                         'Size' => '32',
                                         'Type' => 'Struct'
                                       },
                          '1174287' => {
                                         'BaseType' => '881003',
                                         'Header' => 'Reaper.h',
                                         'Line' => '62',
                                         'Name' => 'unity::scopes::internal::reaper_private::Reaplist',
                                         'NameSpace' => 'unity::scopes::internal::reaper_private',
                                         'Size' => '12',
                                         'Type' => 'Typedef'
                                       },
                          '1174304' => {
                                         'BaseType' => '457674',
                                         'Header' => 'Reaper.h',
                                         'Line' => '39',
                                         'Name' => 'unity::scopes::internal::ReaperCallback',
                                         'NameSpace' => 'unity::scopes::internal',
                                         'Size' => '16',
                                         'Type' => 'Typedef'
                                       },
                          '1174315' => {
                                         'Base' => {
                                                     '980392' => {
                                                                   'pos' => '0'
                                                                 }
                                                   },
                                         'Header' => 'Reaper.h',
                                         'Line' => '123',
                                         'Memb' => {
                                                     '0' => {
                                                              'access' => 'private',
                                                              'name' => 'self_',
                                                              'offset' => '8',
                                                              'type' => '979901'
                                                            },
                                                     '1' => {
                                                              'access' => 'private',
                                                              'name' => 'reap_interval_',
                                                              'offset' => '16',
                                                              'type' => '186632'
                                                            },
                                                     '10' => {
                                                               'access' => 'private',
                                                               'name' => 'reap_in_progress_',
                                                               'offset' => '129',
                                                               'type' => '36673'
                                                             },
                                                     '11' => {
                                                               'access' => 'private',
                                                               'name' => 'reap_mutex_',
                                                               'offset' => '132',
                                                               'type' => '85619'
                                                             },
                                                     '12' => {
                                                               'access' => 'private',
                                                               'name' => 'reap_done_',
                                                               'offset' => '156',
                                                               'type' => '974814'
                                                             },
                                                     '2' => {
                                                              'access' => 'private',
                                                              'name' => 'expiry_interval_',
                                                              'offset' => '24',
                                                              'type' => '186632'
                                                            },
                                                     '3' => {
                                                              'access' => 'private',
                                                              'name' => 'policy_',
                                                              'offset' => '32',
                                                              'type' => '1174327'
                                                            },
                                                     '4' => {
                                                              'access' => 'private',
                                                              'name' => 'list_',
                                                              'offset' => '36',
                                                              'type' => '1174287'
                                                            },
                                                     '5' => {
                                                              'access' => 'private',
                                                              'name' => 'mutex_',
                                                              'offset' => '48',
                                                              'type' => '85619'
                                                            },
                                                     '6' => {
                                                              'access' => 'private',
                                                              'name' => 'reap_thread_',
                                                              'offset' => '72',
                                                              'type' => '188831'
                                                            },
                                                     '7' => {
                                                              'access' => 'private',
                                                              'name' => 'reap_thread_id_',
                                                              'offset' => '76',
                                                              'type' => '188843'
                                                            },
                                                     '8' => {
                                                              'access' => 'private',
                                                              'name' => 'do_work_',
                                                              'offset' => '80',
                                                              'type' => '974814'
                                                            },
                                                     '9' => {
                                                              'access' => 'private',
                                                              'name' => 'finish_',
                                                              'offset' => '128',
                                                              'type' => '36673'
                                                            }
                                                   },
                                         'Name' => 'unity::scopes::internal::Reaper',
                                         'NameSpace' => 'unity::scopes::internal',
                                         'Size' => '204',
                                         'Type' => 'Class'
                                       },
                          '1174327' => {
                                         'BaseType' => '36582',
                                         'Header' => 'Reaper.h',
                                         'Line' => '136',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'NoCallbackOnDestroy',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'CallbackOnDestroy',
                                                              'value' => '1'
                                                            }
                                                   },
                                         'Name' => 'enum unity::scopes::internal::Reaper::DestroyPolicy',
                                         'NameSpace' => 'unity::scopes::internal::Reaper',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1174521' => {
                                         'BaseType' => '980130',
                                         'Header' => 'Reaper.h',
                                         'Line' => '127',
                                         'Name' => 'unity::scopes::internal::Reaper::SPtr',
